Repository: faiproject/fai
Catalog: doc/po/*.po
Languages: fr

source: Now call fai-make-nfsroot which creates the 32-bit nfsroot in '/srv/fai/nfsroot-i386'
fr: Appelez maintenant fai-make-nfsroot qui crée le nfsroot 32 bits dans '/srv/fai/nfsroot-i386'

source: Creating a partial mirror using `fai-mirror(1)` that is needed for a bootable CD or USB stick is also possible on a different architecture. You have to specify the architecture when calling fai-mirror.
fr: La création d’un miroir partiel utilisant `fai-mirror(1)` qui est nécessaire à un CD amorçable ou une clé USB est également possible sur une architecture différente. Vous devez spécifier l’architecture lors de l’appel de fai-mirror.

source: That's all!
fr: Et voilà !

source: === [[error]]Aborting the installation when an error occurs
fr: === [[error]]Arrêt d'urgence de l'installation quand une erreur se produit

source: Every task and hook can call the function +task_error+ to send an error value to the installation. This error will appear in the log file and can be shown in the `fai-monitor-gui(1)`. The error value is also checked against the variable +$STOP_ON_ERROR+ which is set to 700 by default. If the error value is greater than +$STOP_ON_ERROR+ the installation will stop immediately. In a hook, just add a call like this:
fr: Chaque tâche, chaque hook peut appeler la fonction +task_error+ pour envoyer une valeur d'erreur à l'installation. Cette erreur apparaîtra dans le fichier de journalisation et peut être visionnée dans le `fai-monitor-gui(1)`. La valeur de l'erreur est aussi examinée en tenant compte de la variable +$STOP_ON_ERROR+ qui est réglée à 700 par défaut. Si la valeur d'erreur est supérieure à +$STOP_ON_ERROR+, l'installation s'arrêtera immédiatment. Dans un hook, ajoutez simplement un appel comme celui-ci :

source: ---- task_error <value> ----
fr: ---- task_error <valeur> ----

source: It is comfortable to call task_error with $? as second parameter, for e.g. if you want to set an error value of 123 use this
fr: C'est commode d'appeler task_error avec $? comme deuxième paramètre, par exemple si on veut émettre une valeur d'erreur de 123 on peut faire ainsi

source: Then the task error is only set if the preceding command failed with some error. The same syntax can be used by the scripts in the class subdirectory ending in .sh.
fr: Alors, l'erreur de tâche n'est mise en place que si la commande précédente a échoué avec une certaine erreur. La même syntaxe peut être utilisée par les scripts dans le sous-répertoire de classe qui se terminent en .sh.

source: A special case are scripts inside the class/ subdirectory that does not end in .sh. In those scripts you have to call task_error with 1 as third parameter. As an example you can use those two variants for setting the value to 123
fr: Un cas particulier est celui des scripts dans le sous-répertoire class/ qui ne se termine pas en .sh. Dans ces scripts il faut appeler task_error avec 1 comme troisième paramètre. Par exemple on peut utiliser deux variantes pour régler la valeur à 123

source: The latter command always sets the task error to 123 regardless of the value of +$?+. If the error value is greater than +$STOP_ON_ERROR+, the installation will abort immediately.
fr: La dernière commande met toujours l'erreur de tâche à 123 sans tenir compte de $?. Si la valeur d'erreur est supérieure à +$STOP_ON_ERROR+, l'installation sera immédiatement stoppée.

source: The error values are grouped into four categories
fr: Les valeurs d'erreur sont regroupées dans quatre catégories

source: ---- normal or info messages: 1xx, 2xx warnings: 3xx, 4xx minor errors: 5xx, 6xx errors: 7xx, 8xx ----
fr: ---- normale ou messages d'information : 1xx, 2xx avertissements : 3xx, 4xx erreurs mineures : 5xx, 6xx erreurs : 7xx, 8xx ----

source: The fai-monitor-gui has 4 different icons for these error categories.
fr: Le fai-monitor-gui possède 4 icônes différentes pour ces catégories d'erreur.

source: == [[hints]]Various hints and details
fr: == [[hints]]Divers conseils et détails

source: === [[tasks]]The list of tasks
fr: === [[tasks]]La liste des tâches

source: Most tasks of the installation are defined as subroutines which are defined in '/usr/lib/fai/subroutines' (e.g. +task_instsoft+). Some are external shell scripts located in '/usr/lib/fai/'. They are called via a superior subroutine called _task_. This subroutine calls hooks if available and then calls the task (defined as __task_<name>__). A task and its hooks can be skipped on demand by using the command _skiptask()_.
fr: La plupart des tâches de l’installation sont définies comme des sous-routines qui sont définies dans '/usr/lib/fai/subroutines' (par exemple +task_instsoft+). Certaines sont des scripts shell externes situés dans '/usr/lib/fai/'. Elles sont appelées via un sous-programme supérieur nommé _task_. Ce sous-programme appelle les hooks si disponibles, puis appelle la tâche (définie comme __task__<nom>_). Une tâche et ses hooks peuvent être ignorés à la demande en utilisant la commande _skiptask()_.

source: Now follows the description of all tasks, listed in the order they are executed.
fr: Voici maintenant la description de toutes les tâches, énumérées dans l’ordre dans lequel elles sont exécutées.

source: confdir:: The kernel appended parameters may define variables, the syslog daemon is started. Network parameters are fetched from a DHCP server and are stored in +boot.log+. The DNS resolver configuration file is created. + The location of the configuration space is defined by the variable +$FAI_CONFIG_SRC+. + After that, the file '$FAI/hooks/subroutines' is sourced if it exists. Using this file, you can define your own subroutines or override the definition of FAI's subroutines.
fr: confdir:: Les paramètres ajoutés au noyau peuvent définir des variables, le démon syslog est démarré. Les paramètres de réseau sont récupérés d'un serveur DHCP et sont enregistrés dans +boot.log+. La configuration pour la résolution DNS est créée. + L’emplacement de l’espace de configuration est défini par la variable +$FAI_CONFIG_SRC+. + Ensuite, le fichier '$FAI/hooks/subroutines' est sourcé s’il existe. En utilisant ce fichier, vous pouvez définir vos propres sous-programmes ou remplacer la définition des sous-programmes de FAI.

source: setup:: This task sets the system time, all +$FAI_FLAGS+ are defined and two additional virtual terminals are opened on demand. A secure shell daemon is started on demand for remote logins.
fr: setup:: Cette tâche définit l’heure du système, tous les +$FAI_FLAGS+ sont définis et deux terminaux virtuels supplémentaires sont ouverts à la demande. Un démon ssh est lancé à la demande pour les connexions à distance.

source: defclass:: Calls `fai-class(1)` to define classes using scripts and files in '$FAI/class' and classes from '/tmp/fai/additional-classes' and the variable +$ADDCLASSES+. The list of all defined classes is stored in the variable +$classes+ and saved to '/tmp/fai/FAI_CLASSES'.
fr: defclass:: Appels de `fai-class(1)` pour définir des classes à l’aide de scripts et de fichiers dans '$FAI/class' et classes de '/tmp/fai/additional-classes' et la variable +$ADDCLASSES+. La liste de toutes les classes définies est stockée dans la variable +$classes+ et enregistrée dans '/tmp/fai/FAI_CLASSES'.

source: defvar:: Sources all files '$FAI/class/*.var' for every defined class. If a hook has written some variable definitions to the file '$LOGDIR/additional.var', this file is also sourced.
fr: defvar:: Source tous les fichiers '$FAI/class/*.var' pour chaque classe définie. Si un hook a écrit quelques définitions de variables dans le fichier '$LOGDIR/additional.var', ce fichier est également sourcé.

source: action:: Depending on the value of +$FAI_ACTION+ this subroutine decides which action FAI should perform. The default available actions are: _sysinfo_, _install_, _inventory_, _dirinstall_ and _softupdate_. If +$FAI_ACTION+ has another value, a user defined action is called if a file '$FAI/hooks/$FAI_ACTION' exists. So you can easily define your own actions.
fr: action:: En fonction de la valeur de +$FAI_ACTION+, ce sous-programme décide de l’action FAI à exécuter. Les actions disponibles par défaut sont : _sysinfo_, _install_, _inventory_, _dirinstall_ et _softupdate_. Si +$FAI_ACTION+ a une autre valeur, une action définie par l’utilisateur est appelée si un fichier '$FAI/hooks/$FAI_ACTION' existe. Ainsi, vous pouvez facilement définir vos propres actions.

source: sysinfo:: Called when no installation is performed but the action is _sysinfo_. It shows information about the detected hardware and mounts the local hard disks read only to '/target/+partitionname+' or with regard to a 'fstab' file found inside a partition. Log files are stored to the install server.
fr: sysinfo:: Appelée lorsque aucune installation n’est effectuée mais que l’action est _sysinfo_. Elle affiche des informations sur le matériel détecté et monte les disques durs locaux en lecture seule sur '/target/+partitionname+' ou en tenant compte d’un fichier 'fstab' trouvé à l’intérieur d’une partition. Les fichiers journaux sont stockés sur le serveur d’installation.

source: inventory:: A short list of system information is printed.
fr: inventory:: Une courte liste des informations système est imprimée.

source: install:: This task controls the installation sequence. You will hear three beeps before the installation starts. The major work is to call other tasks and to save the output to '/tmp/fai/fai.log'. If you have any problems during installation, look at all files in '/tmp/fai/'. You can find examples of the log files at https://fai-project.org/logs/.
fr: install:: Cette tâche contrôle la séquence d’installation. Vous entendrez trois bips avant le début de l’installation. Le travail principal consiste à appeler d’autres tâches et à enregistrer la sortie dans '/tmp/fai/fai.log'. Si vous avez des problèmes pendant l’installation, regardez tous les fichiers dans '/tmp/fai/'. Vous trouverez des exemples de fichiers journaux à l’adresse https://fai-project.org/logs/.

source: dirinstall:: Install into a directory, not onto a local disk. Use this for creating chroot environments.
fr: dirinstall:: Installe dans un répertoire, et non pas sur un disque local. Utilisez-le pour créer des environnements chroot.

source: softupdate:: This task, executed inside a running system via the `fai(8)` command line interface, performs a softupdate. See chapter <<softupdate>> for details.
fr: softupdate:: Cette tâche, exécutée à l’intérieur d’un système en cours d’exécution via la commande en ligne `fai(8)`, effectue un softupdate. Voir le chapitre <<softupdate>> pour plus de détails.

source: partition:: Calls `setup-storage(8)` to partition the hard disks and to create file systems. The task writes variable definitions for the root and boot partition and device (+$ROOT_PARTITION, $BOOT_PARTITION, $BOOT_DEVICE+) to '/tmp/fai/disk_var.sh' and creates a 'fstab' file for the new system.
fr: partition:: Appelle `setup-storage(8)` pour partitionner les disques durs et créer des systèmes de fichiers. La tâche écrit des définitions de variables pour les partitions et périphériques racine et de démarrage (+$ROOT_PARTITION, $BOOT_PARTITION, $BOOT_DEVICE+) dans '/tmp/fai/disk_var.sh' et crée un fichier 'fstab' pour le nouveau système.

source: mountdisks:: Mounts the created partitions according to the created '/tmp/fai/fstab' file relative to +$FAI_ROOT+.
fr: mountdisks:: Monte les partitions créées en fonction du fichier '/tmp/fai/fstab' créé par rapport à +$FAI_ROOT+.

source: extrbase:: Extracts a minimal system after that a chroot can be made into it. By default the base tar file '/var/tmp/base.tar.xz' will be extracted. Also files matching a class name in `$FAI/basefiles/` are used for unpacking a different tar file depending on classes defined. This can be used for installing different Linux distributions than the one used for creating the nfsroot. The default file 'base.tar.xz' is a snapshot of a basic Debian system created by `debootstrap(8)`. This task uses the variable +FAI_BASEFILEURL+ for fetching the base file via FTP, HTTPS or HTTP if it's defined.
fr: extrbase:: Extrait un système minimal après lequel un chroot puisse y être introduit. Par défaut, le fichier tar de base '/var/tmp/base.tar.xz' sera extrait. Les fichiers correspondant à un nom de classe dans `$FAI/basefiles/` sont également utilisés pour décompresser un autre fichier tar selon les classes définies. Cela peut être utilisé pour installer des distributions Linux différentes de celles utilisées pour créer le nfsroot. Le fichier par défaut 'base.tar.xz' est un instantané d’un système Debian de base créé par `debootstrap(8)` Cette tâche utilise la variable +FAI_BASEFILEURL+ pour récupérer le fichier de base via FTP, HTTPS ou HTTP si celle-ci est définie.

source: debconf:: Calls `fai-debconf(1)` to set the values for the debconf preseeding database.
fr: debconf:: Appelle `fai-debconf(1)` pour définir les valeurs de la base de données de pré-ensemencement de debconf.

source: repository:: Prepare access to the package repository by preparing the apt configuration. This can also add repository keys in a class based manner from files like _CLASSNAME.gpg_ in the directory _package_config_.
fr: repository:: Prépare l’accès au dépôt de paquets en préparant la configuration apt. Cela peut également ajouter des clés de dépôts en tenant compte des classes à partir de fichiers comme _CLASSNAME.gpg_ dans le répertoire _package_config_.

source: updatebase:: Updates the base packages of the new system and updates the list of available packages. It also fakes some commands (called diversions) inside the new installed system using `dpkg-divert(8)`, so no daemons will be started during the installation.
fr: updatebase:: Met à jour les paquets de base du nouveau système et met à jour la liste des paquets disponibles. Il contrefait également certaines commandes (appelées diversions) à l’intérieur du nouveau système installé à l’aide de `dpkg-divert(8)`, de sorte qu’aucun démon ne soit démarré pendant l’installation.

source: instsoft:: Installs the desired software packages using class files in '$FAI/package_config/'.
fr: instsoft:: Installe les paquets logiciels souhaités en utilisant des fichiers de classe dans '$FAI/package_config/'.

source: configure:: Calls scripts in '$FAI/scripts/' and its subdirectories for every defined class.
fr: configure:: Appelle les scripts dans '$FAI/scripts/' et ses sous-répertoires pour chaque classe définie.

source: tests:: Calls test scripts in '$FAI/tests/' and its subdirectories for every defined class.
fr: tests:: Appelle les scripts de test dans '$FAI/tests/' et ses sous-répertoires pour chaque classe définie.

source: finish:: Unmounts all file systems in the new installed system and removes diversions of files using the command `fai-divert`.
fr: finish:: Démonte tous les systèmes de fichiers dans le nouveau système installé et supprime les diversions de fichiers à l’aide de la commande `fai-divert`.

source: chboot:: Changes the PXE configuration for a host on the install server which indicates which PXELINUX configuration to load on the next boot from network card via TFTP. Therefore the `fai-chboot(8)` command is executed remotely on the install server.
fr: chboot:: Modifie la configuration PXE d’un hôte sur le serveur d’installation, qui indique quelle configuration PXELINUX doit être chargée lors de la prochaine initialisation à partir de la carte réseau via TFTP. Par conséquent, la commande `fai-chboot(8)` est exécutée à distance sur le serveur d’installation.

source: savelog:: Saves log files to local disk and to the account +$LOGUSER+ on +$LOGSERVER+ (defaults to the install server).
fr: savelog:: Enregistre les fichiers journaux sur le disque local et sur le compte +$LOGUSER+ sur +$LOGSERVER+ (par défaut sur le serveur d’installation).

source: faiend:: Wait for background jobs to finish (e.g. emacs compiling lisp files) and automatically reboots the install clients or waits for manual input before reboot.
fr: faiend:: Attend que les travaux en arrière-plan se terminent (par exemple, qu'emacs compile des fichiers lisp) puis redémarre automatiquement les clients d’installation ou attend la saisie manuelle avant le redémarrage.

source: === [[itests]]Automated tests
fr: === [[itests]]Tests automatisés

source: After the customization scripts are executed, FAI will execute some tests if available. Using these test, you can check for errors of the installation. Test scripts are called via `fai-do-scripts(1)` and should append its messages to _$LOGDIR/test.log_. A Perl module including some useful subroutines can be found in _Faitest.pm_. A test can also define a new class for executing another tests during next boot via the variable +$ADDCLASSES+.
fr: Après l’exécution des scripts de personnalisation, FAI exécutera certains tests si disponibles. En utilisant ces tests, vous pouvez vérifier les erreurs de l’installation. Les scripts de test sont appelés via `fai-do-scripts(1)` et doivent ajouter leurs messages à '$LOGDIR/test.log'. Un module Perl comprenant des sous-routines utiles peut être trouvé dans _Faitest.pm_. Un test peut également définir une nouvelle classe pour exécuter d’autres tests lors du prochain démarrage via la variable +$ADDCLASSES+.

source: === [[autodiscover]] Autodiscover
fr: === [[autodiscover]]Découvrir automatiquement

source: In FAI 5.0 we released a feature that allows clients to search for the faiserver in their respective subnetwork. This lifts the necessity of having to collect every client's MAC address and configuring the DHCP daemon.
fr: Dans FAI 5.0, nous avons publié une fonctionnalité qui permet aux clients de rechercher le faiserver dans leur sous-réseau respectif. Cela soulève la nécessité de récupérer l’adresse MAC de chaque client et de configurer le démon DHCP.

source: This is done by booting from a small FAI autodiscover bootmedium (CD, USB, etc.), which can be created via the command:
fr: Cela se fait en démarrant à partir d’une petit media vif autodiscover FAI (CD, USB, etc.), qui peut être créé via la commande :

source: The image is roughly 25MB in size and scans the subnet for a FAI server. By default it shows a menu with all profiles available in the configuration space in the same manner as the 'menu' flag does. From this menu, you can select the installation type you wish to perform.
fr: L’image a une taille d’environ 25 Mo et analyse le sous-réseau d’un serveur FAI. Par défaut, il affiche un menu avec tous les profils disponibles dans l’espace de configuration de la même manière que le fait l'option 'menu'. Dans ce menu, vous pouvez sélectionner le type d’installation que vous souhaitez effectuer.

source: For the clients to find the faiserver, the faiserver must run fai-monitor.
fr: Pour que les clients puissent trouver le faiserver, le faiserver doit lancer fai-monitor.

source: === [[changeboot]]Changing the boot device
fr: === [[changeboot]]Modification du périphérique d’amorçage

source: Changing the boot sequence is normally done in the BIOS setup. But you can't change the BIOS from a running Linux system.
fr: La modification de la séquence d’amorçage s’effectue normalement dans la configuration du BIOS. Mais vous ne pouvez pas changer le BIOS d’un système Linux en cours d’exécution.

source: So, the boot sequence of the BIOS will remain unchanged and your computer should always boot first from its network card and the second boot device should be the local disk. Then you can change the boot device of the client by creating different PXELINUX configurations. This will define if an installation should be performed, or if the client should to boot from local disk. This is done using `fai-chboot(8)`.
fr: Ainsi, la séquence d’amorçage du BIOS restera inchangée et votre ordinateur devrait toujours démarrer en premier à partir de sa carte réseau et le deuxième périphérique d’amorçage devrait être le disque local. Ensuite, vous pouvez changer le périphérique d’amorçage du client en créant différentes configurations PXELINUX. Cela définira si une installation doit être effectuée, ou si le client doit démarrer à partir du disque local. Cela se fait à l’aide de `fai-chboot(8)`.

source: === [[debian-mirror]]How to create a local Debian mirror
fr: === [[debian-mirror]]Comment créer un miroir Debian local

source: The utility `mkdebmirror` footnote:[You can find the script in '/usr/share/doc/fai-doc/examples/utils/'] can be used for creating your own local Debian mirror. This script uses `debmirror(1)`. A partial Debian mirror for amd64 architecture for Debian 11 and 12 (aka bullseye and bookworm) without the source packages needs about 180GB of disk space. Accessing the mirror via HTTP will be the default way in most cases. To see more output from the script call +mkdebmirror -v+. A root account is not necessary to create and maintain the Debian mirror.
fr: Le script utilitaire `mkdebmirror` footnote:[On peut trouver ce script dans '/usr/share/doc/fai-doc/examples/utils/'] peut être utilisé pour créer votre propre miroir Debian local. Ce script utilise la commande `debmirror(1)`. Un miroir Debian partiel pour l’architecture amd64 pour Debian 11 et 12 (noms de code bullseye et bookworm) sans les paquets source nécessite environ 180 Go d’espace disque. L’accès au miroir via HTTP sera la méthode par défaut dans la plupart des cas. Pour afficher plus de résultats à partir du script, appelez +mkdebmirror -v+. Un compte root n’est pas nécessaire pour créer et maintenir le miroir Debian.

source: To use HTTP access to the local Debian mirror, install a web server and create a symlink to the local directory where your mirror is located:
fr: Pour utiliser l’accès HTTP au miroir Debian local, installez un serveur web et créez un lien symbolique vers le répertoire local où se trouve votre miroir :

source: Create a file `sources.list(5)` in '/etc/fai/apt' which gives access to your Debian mirror. Also add the IP-address of the HTTP server to the variable +$NFSROOT_ETC_HOSTS+ in 'nfsroot.conf' if the install clients have no DNS resolving.
fr: Créez un fichier `sources.list(5)` dans '/etc/fai/apt' qui donne accès à votre miroir Debian. Ajoutez également l’adresse IP du serveur HTTP à la variable +$NFSROOT_ETC_HOSTS+ dans 'nfsroot.conf' si les clients d’installation n’ont pas de résolution DNS.

source: === Small hints
fr: === Petits conseils

source: - When using HTTP access to a Debian mirror, the local _/var_ partition on all install clients must be big enough to keep the downloaded Debian packages. Do not try with less than 250 Mbytes unless you know why. You can limit the number of packages installed at a time with the variable +$MAXPACKAGES+.
fr: - Lorsque vous utilisez l’accès HTTP à un miroir Debian, la partition locale _/var_ sur tous les clients d’installation doit être suffisamment grande pour conserver les paquets Debian téléchargés. N’essayez pas avec moins de 250 Moctets à moins que vous sachiez pourquoi. Vous pouvez limiter le nombre de paquets installés à la fois avec la variable +$MAXPACKAGES+.

source: - You can remove the red logo on the install client by simply calling `reset` once. If will also not appear if you create a file using this command on the install server:
fr: - Vous pouvez supprimer le logo rouge sur le client d’installation en appelant simplement une fois `reset`. Il ne s’affichera pas si vous créez un fichier à l’aide de cette commande sur le serveur d’installation :

source: - A list of variables used by FAI can be found at https://wiki.fai-project.org/index.php/Variables.
fr: - Une liste des variables utilisées par FAI peut être trouvée à https://wiki.fai-project.org/index.php/Variables.
