Repository: faiproject/fai
Catalog: doc/po/*.po
Languages: fr

source: The command `install_packages(8)` reads the config files from '$FAI/package_config' in a class based manner and installs software packages on the new file system.
fr: La commande `install_packages(8)` lit les fichiers de configuration à partir de '$FAI/package_config' d'une façon basée sur la classe et installe des paquets logiciels sur le nouveau système de fichiers.

source: It installs the packages using `apt-get(8)`, `aptitude(1)`, `yum` or other package tools without any manual interaction needed. Package dependecies are also resolved by the package tools.
fr: Elle installe les paquets en utilisant `apt-get(8)`, `aptitude(1)`, `yum` ou d’autres gestionnaires de paquets sans besoin d'aucune interaction manuelle. Les dépendances des paquets sont également résolues par les gestionnaires de paquets.

source: The format of the configuration files is described in <<packageconfig>>.
fr: Le format des fichiers de configuration est décrit dans <<packageconfig>>.

source: Additionaly FAI will install packages ('.deb' or .rpm') from the directories '$FAI/pkgs/<CLASSNAME>'.
fr: De plus, FAI installera les paquets ('.deb' or .rpm') depuis les répertoires '$FAI/pkgs/<CLASSNAME>'.

source: === [[icscripts]]Site specific customization (task configure)
fr: === [[icscripts]]Personnalisation spécifique au site (tâche configure)

source: Often the default configurations of the software packages will not meet your site-specific needs. You can call arbitrary scripts which adjust the system configuration. Therefore the command `fai-do-scripts(1)` executes scripts in '$FAI/scripts' in a class based manner. It is possible to have several scripts of different types (shell, cfengine, ...) to be executed for one class.
fr: Souvent, les configurations par défaut des paquets logiciels ne répondent pas à vos besoins spécifiques au site. Vous pouvez appeler des scripts arbitraires qui ajustent la configuration du système. Par conséquent, la commande `fai-do-scripts(1)` exécute des scripts dans '$FAI/scripts' d’une manière basée sur la classe. Il est possible d’avoir plusieurs scripts de différents types (shell, cfengine, …) à exécuter pour une classe.

source: The default set of scripts in '$FAI/scripts' include examples for installing Debian and Rocky Linux machines. They set the root password, add a user account (set by '$username, default to demo), set the timezone, configure the network for DHCP or using a fixed IP address, setup grub and more. They should do a reasonable job for your installation. You can edit them or add new scripts to match your local needs.
fr: L’ensemble de scripts par défaut dans '$FAI/scripts' inclut des exemples d’installation de machines Debian et Rocky Linux. Ils définissent le mot de passe root, ajoutent un compte utilisateur (défini par '$username', avec demo par défaut), paramètrent le fuseau horaire, configurent le réseau avec DHCP ou en utilisant une adresse IP fixe, configurent grub et plus encore. Ils devraient faire un travail raisonnable pour votre installation. Vous pouvez les modifier ou ajouter de nouveaux scripts pour répondre à vos besoins locaux.

source: More information about these scripts are described in <<cscripts>>.
fr: Plus d’information sur ces scripts est disponible dans <<cscripts>>.

source: === [[isavelog]]Saving log files (task savelog)
fr: === [[isavelog]]Enregistrement des fichiers journaux (tâche savelog)

source: When all tasks are finished, the log files are written to _/var/log/fai/$HOSTNAME/install/_ footnote:['/var/log/fai/localhost/install/' is a link to this directory.] on the new system and to the account on the install server if +$LOGUSER+ is defined (you have to enable this in '/srv/fai/config/class/FAIBASE.var'). It is also possible to specify another host as log saving destination through the variable +$LOGSERVER+. If +$LOGSERVER+ is not defined, FAI uses the variable +$SERVER+ which is only defined during an initial installation (by get-boot-info).
fr: Lorsque toutes les tâches sont terminées, les fichiers journaux sont écrits dans _/var/log/fai/$HOSTNAME/install/_ footnote:['/var/log/fai/localhost/install/' est un lien vers ce répertoire.] sur le nouveau système, et sur le compte sur le serveur d’installation si +$LOGUSER+ est défini (il faut l'activer dans '/srv/fai/config/class/FAIBASE.var'). Il est également possible de spécifier un autre hôte comme destination pour cet enregistrement à l'aide de la variable +$LOGSERVER+. Si +$LOGSERVER+ n’est pas défini, FAI utilise la variable +$SERVER+ qui n’est définie que lors d’une installation initiale (par get-boot-info).

source: Additionally, two symlinks will be created to indicated the last directory written to. The symlink 'last' points to the log directory of the last FAI action performed. The symlinks 'last-install' and 'last-sysinfo' point to the directory of the last corresponding action. By default log files will be copied to the log server using scp. You can use the variable +$FAI_LOGPROTO+ in file 'fai.conf(5)' to choose another method for saving logs to the remote server. Here's an example of the symlink structure:
fr: De plus, deux liens symboliques seront créés pour indiquer le dernier répertoire où on a écrit. Le lien symbolique 'last' pointe vers le répertoire journal de la dernière action FAI exécutée. Les liens symboliques 'last-install' et 'last-sysinfo' pointent vers le répertoire avec la dernière action correspondante. Par défaut, les fichiers journaux seront copiés sur le serveur de journalisation à l’aide de scp. Vous pouvez utiliser la variable +$FAI_LOGPROTO+ dans le fichier 'fai.conf(5)' pour choisir une autre méthode d’enregistrement des journaux sur le serveur distant. Voici un exemple de structure de lien symbolique :

source: Examples of the log files can be found at https://fai-project.org/logs.
fr: Vous trouverez des exemples de fichiers journaux à l’adresse https://fai-project.org/logs.

source: === [[ireboot]]Reboot the new installed system
fr: === [[ireboot]]Redémarrage du nouveau système installé

source: Before rebooting, the install client calls `fai-chboot -d <hostname>` on the install server, to disable its own PXELINUX configuration. Otherwise, it would restart the installation during the next boot. Normally this should boot the new installed system from its second boot device, the local hard disk.
fr: Avant de redémarrer, le client d’installation appelle `fai-chboot -d <hostname>` sur le serveur d’installation, pour désactiver sa propre configuration PXELINUX. Sinon, il redémarrerait l’installation lors de la prochaine initialisation. Normalement, cela devrait démarrer le nouveau système installé à partir de son second périphérique d’amorçage, le disque dur local.

source: At the end, the system is automatically rebooted if "reboot" was added to +$FAI_FLAGS+.
fr: À la fin, le système est automatiquement redémarré si "reboot" a été ajouté à +$FAI_FLAGS+.

source: == [[advanced]]Advanced FAI topics
fr: == [[advanced]]Sujets avancés pour FAI

source: === [[checkbootp]]Checking parameters received from DHCP servers
fr: === [[checkbootp]]Vérification des paramètres reçus des serveurs DHCP

source: If the install client boots you can check if all information from the DHCP daemon are received correctly. The received information is written to '/tmp/fai/boot.log'. An example of the result of a DHCP request can be found in the sample log files.
fr: Si le client d’installation démarre, vous pouvez vérifier si toutes les informations provenant du démon DHCP sont correctement reçues. Les informations reçues sont écrites dans '/tmp/fai/boot.log'. Un exemple de résultat d’une requête DHCP peut être trouvé dans les fichiers journaux d’exemple.

source: === [[fai-monitor]]Monitoring multiple client installations
fr: === [[fai-monitor]]Surveillance de plusieurs clients d'installation

source: You can monitor the installation of all install clients with the command `fai-monitor(8)`. All clients check if this daemon is running on the install server (or the machine defined by the variable +$monserver+). Each time a task starts or ends, a message is sent. The FAI monitor daemon prints this messages to standard output. There's also a graphical frontend available, called `fai-monitor-gui(1)`.
fr: Vous pouvez surveiller l’installation de tous les clients d’installation avec la commande `fai-monitor(8)`. Tous les clients vérifient si ce démon est en cours d’exécution sur le serveur d’installation (ou sur l’ordinateur défini par la variable +$monserver+). Chaque fois qu’une tâche démarre ou se termine, un message est envoyé. Le démon du moniteur FAI envoie ces messages dans sa sortie standard. On peut aussi utiliser une interface graphique, appelée `fai-monitor-gui(1)`.

source: === [[mac]]Collecting Ethernet addresses for multiple hosts
fr: === [[mac]]Collecte d’adresses Ethernet pour plusieurs hôtes

source: You have to collect all Ethernet (MAC) addresses of the install clients and assign a host name and IP address to each client. To collect the MAC addresses, boot your install clients. You can already do this before any DHCP daemon is running in your subnet. They will fail to boot (because of the missing DHCP or missing TFTP), but you can still collect the MAC addresses.
fr: Vous devez collecter toutes les adresses Ethernet (MAC) des clients d’installation et affecter un nom d’hôte et une adresse IP à chaque client. Pour collecter les adresses MAC, démarrez vos clients d’installation. Vous pouvez déjà le faire avant que n’importe quel démon DHCP s’exécute dans votre sous-réseau. Ils échoueront à démarrer (en raison de l'absence de DHCP ou de TFTP), mais vous pouvez toujours collecter les adresses MAC.

source: While the install clients are booting, they send broadcast packets to the LAN. You can log the MAC addresses of these hosts by running the following command simultaneously on the server:
fr: Pendant que les clients d’installation démarrent, ils envoient des paquets de diffusion (broadcast) au LAN. Vous pouvez enregistrer les adresses MAC de ces hôtes en exécutant simultanément la commande suivante sur le serveur :

source: After the hosts have been sent some broadcast packets abort `tcpdump` by typing _ctrl-c_. You get a list of all unique MAC addresses with these commands:
fr: Une fois que les hôtes ont envoyés quelques paquets de diffusion, arrêtez `tcpdump` en tapant _ctrl-c_. Vous obtenez une liste de toutes les adresses MAC uniques avec ces commandes :

source: After that, you only have to assign these MAC addresses to host names and IP addresses ('/etc/ethers' and '/etc/hosts' or corresponding NIS maps). With this information you can configure your `DHCP` daemon (see the section <<bootdhcp>>). footnote:[I recommend to write the MAC addresses (last three bytes will suffice if you have network cards from the same vendor) and the host name in the front of each chassis.]
fr: Après cela, vous n’avez qu'à assigner ces adresses MAC aux noms d’hôte et aux adresses IP ('/etc/ethers' et '/etc/hosts' ou aux associations NIS correspondantes). Avec ces informations, vous pouvez configurer votre démon DHCP (voir la section <<bootdhcp>>). footnote:[Je recommande d'inscrire l'adresse MAC (les trois derniers octets devraient suffire si vous avez des cartes du même vendeur) et le nom d'hôte devant chaque boîtier.]

source: ==== Debugging the network traffic
fr: ==== Débogage du trafic réseau

source: If the client can't successfully boot from the network card, use `tcpdump(8)` to look for Ethernet packets between the install server and the client. Search also for entries in several log files made by `tftpd(8)` and `dhcpd(8)` :
fr: Si le client ne peut démarrer correctement à partir de la carte réseau, utilisez `tcpdump(8)` pour rechercher des paquets Ethernet entre le serveur d’installation et le client. Recherchez également dans les entrées de plusieurs fichiers journaux venant de `tftpd(8)` et `dhcpd(8)` :

source: === [[pxeboot]]Details of PXE booting
fr: === [[pxeboot]]Détails du démarrage PXE

source: Here we describe the details of PXE booting, which are only needed if you have problems when booting your install clients.
fr: Ici, nous décrivons les détails du démarrage PXE, qui sont nécessaires seulement si vous avez des problèmes lors du démarrage de vos clients d’installation.

source: Almost all modern bootable network cards support the PXE boot environment. PXE is the Preboot Execution Environment. This requires the PXELINUX bootloader and a special version of the _TFTP_ daemon, which is available in the Debian packages +pxelinux+ and +tftpd-hpa+. PXE booting also needs a DHCP server, so that the network card can configure its IP parameters. This is the sequence of a PXE boot:
fr: Presque toutes les cartes réseau modernes prennent en charge l’environnement de démarrage PXE. PXE est l’environnement d’exécution de pré-lancement. Cela nécessite le chargeur de démarrage PXELINUX et une version spéciale du démon _TFTP_, disponibles dans les paquets Debian +pxelinux+ et +tftpd-hpa+. Le démarrage PXE nécessite également un serveur DHCP, afin que la carte réseau puisse configurer ses paramètres IP. Voici la séquence d’une amorce PXE :

source: * Network card of the client sends its MAC address * DHCP server replies with IP configuration for the client * Network card configures IP * Install client gets the pxelinux.0 binary via TFTP * Get the pxelinux.cfg/C0A8210C configuration file via TFTP * C0A8210C is the IP address of the client in hexadecimal * This configuration contains kernel, initrd and additional kernel command line parameters, which was created by `fai-chboot`. * Get the kernel and initrd via TFTP.
fr: * La carte réseau du client envoie son adresse MAC * Le serveur DHCP répond par la configuration IP du client * La carte réseau configure son IP * Le client d’installation obtient le binaire pxelinux.0 via TFTP * Il obtient le fichier de configuration pxelinux.cfg/C0A8210C via TFTP * C0A8210C est l’adresse IP du client en hexadécimal * Cette configuration contient le noyau, le fichier initrd et les paramètres de ligne de commande supplémentaires du noyau, qui ont été créés par `fai-chboot`. * Il obtient le noyau et le fichier initrd via TFTP.

source: Example of a pxelinux.cfg file: ---- default fai-generated
fr: Exemple d'un fichier pxelinux.cfg : ---- default fai-generated

source: See '/usr/share/doc/syslinux/pxelinux.doc' for more detailed information about PXELINUX. FAI uses the lpxelinux.0 binary which also supports loading the kernel and initrd via FTP or HTTP. The command 'fai-chboot(8)' supports this with the option '-U'.
fr: Voir '/usr/share/doc/syslinux/pxelinux.doc' pour des informations plus détaillées sur PXELINUX. FAI utilise le fichier binaire lpxelinux.0 qui s'occupe du chargement du noyau et du fichier initrd via FTP ou HTTP. La commande `fai-chboot(8)` prend cela en charge avec l’option '-U'.

source: === [[Customizing your install server setup]]Customizing your install server setup
fr: === [[Customizing your install server setup]]Personnaliser la configuration de son serveur d’installation

source: - local/faster package mirror - different loguser - local root pw inside nfsroot
fr: - Miroir de paquets logiciels local/plus rapide - Loguser différent - Mot de passe root local dans nfsroot

source: The configuration for the FAI package (not the configuration data for the install clients) is defined in 'fai.conf(5)'. Definitions that are only used for creating the nfsroot are located in 'nfsroot.conf(5)'. Check these important variables in 'nfsroot.conf' before calling 'fai-setup' or 'fai-make-nfsroot'.
fr: La configuration du paquet FAI (et non les données de configuration pour les clients d’installation) est définie dans 'fai.conf(5)'. Les définitions qui sont utilisées uniquement pour créer le nfsroot sont situées dans 'nfsroot.conf(5)'. Vérifiez ces variables importantes dans 'nfsroot.conf' avant d’appeler 'fai-setup' ou 'fai-make-nfsroot'.

source: FAI_DEBOOTSTRAP:: Building the nfsroot uses the command `debootstrap(8)`. It needs the location of a Debian mirror and the name of the distribution (like bullsseye, bookworm, sid) for which the basic Debian system should be built. Do not use different distributions here and in '/etc/fai/apt/sources.list'. This will create a broken nfsroot.
fr: FAI_DEBOOTSTRAP:: La construction du nfsroot utilise la commande `debootstrap(8)`. Elle a besoin de l’emplacement d’un miroir Debian et du nom de la distribution (comme bullsseye, bookworm, sid) pour laquelle le système Debian de base devrait être construit. N’utilisez pas de distributions différentes ici et dans '/etc/fai/apt/sources.list'. Cela créerait un nfsroot dysfonctionnel.

source: NFSROOT_ETC_HOSTS:: This variable is only needed if the clients do not have access to a DNS server. This multiline variable is added to /etc/hosts inside the nfsroot. Then the install clients can access those hosts by name without using DNS.
fr: NFSROOT_ETC_HOSTS:: Cette variable est nécessaire seulement si les clients n’ont pas accès à un serveur DNS. Cette variable multiligne est ajoutée à /etc/hosts dans le nfsroot. Ensuite, les clients d’installation peuvent accéder à ces hôtes par leur nom sans utiliser DNS.

source: The content of '/etc/fai/apt/sources.list' is used by the install server and also by the clients. If your install server has multiple network cards and different host names for each card (as for a Beowulf server), use the install server name which is known by the install clients.
fr: Le contenu de '/etc/fai/apt/sources.list' est utilisé par le serveur d’installation et aussi par les clients. Si votre serveur d’installation a plusieurs cartes réseau et différents noms d’hôte pour chaque carte (comme pour un serveur Beowulf), utilisez le nom du serveur d’installation qui est connu des clients d’installation.

source: If you have problems running `fai-setup`, they usually stem from `fai-make-nfsroot(8)` which is called by former command. Adding '-v' gives you a more verbose output which helps you pinpoint the error. The output is written to '/var/log/fai/fai-make-nfsroot.log'. footnote:[For debugging purpose it may help to enter the chroot environment manually using this command. 'faiserver# chroot /srv/fai/nfsroot bash']
fr: Si vous avez des problèmes lors de l’exécution de `fai-setup`, ils proviennent habituellement de `fai-make-nfsroot(8)` qui est appelé par la commande précédente. L’ajout de '-v' vous donne une sortie plus détaillée qui vous aide à repérer l’erreur. La sortie est écrite dans '/var/log/fai/fai-make-nfsroot.log'. footnote:[À des fins de débogage, il peut être utile d'entrer dans l'environnement chroot à la main à l'aide de cette commande : 'faiserver# chroot /srv/fai/nfsroot bash']

source: The setup also creates the account _fai_ (defined by +$LOGUSER+) if not already available. So you can add a user before calling `fai-setup(8)` using the command `adduser(8)` and use this as your local account for saving log files. The log files of all install clients are saved to the home directory of this account. You should change the primary group of this account, so this account has write permissions to '/srv/tftp/fai' in order to call fai-chboot for creating the PXE configuration for the hosts.
fr: L’installation crée également le compte _fai_ (défini par +$LOGUSER+) s’il n’est pas déjà disponible. Vous pouvez donc ajouter un utilisateur avant d’appeler `fai-setup(8)` à l’aide de la commande `adduser(8)` et l'utiliser comme compte local pour enregistrer des fichiers journaux. Les fichiers journaux de tous les clients d’installation sont enregistrés dans le répertoire de personnel de ce compte. Vous devriez changer le groupe principal de ce compte, afin que ce compte ait des droits d'écriture sur '/srv/tftp/fai' afin d'appeler fai-chboot pour créer la configuration PXE pour les hôtes.

source: When you make changes to 'fai.conf', 'nfsroot.conf' the nfsroot has to be rebuilt by calling `fai-make-nfsroot(8)`. If you only like to install a new kernel package to the nfsroot add the flags _-k_ or _-K_ to +fai-make-nfsroot+. This will not recreate your nfsroot, but only updates your kernel and kernel modules inside the nfsroot or add additional packages into the nfsroot.
fr: Lorsque vous apportez des modifications à 'fai.conf', 'nfsroot.conf', le nfsroot doit être reconstruit en appelant `fai-make-nfsroot(8)`. Si vous souhaitez uniquement installer un nouveau paquet de noyau sur nfsroot, ajoutez les options _-k_ ou _-K_ à +fai-make-nfsroot+. Cela ne recréera pas votre nfsroot, mais mettra à jour seulement vos noyaux et les modules du noyau dans le nfsroot ou ajoutera des paquets supplémentaires dans le nfsroot.

source: === [[cdboot]]Creating a FAI CD or and USB stick
fr: === [[cdboot]]Création d’un CD ou d’une clé USB FAI

source: You can easily create an installation CD (or USB stick) of your network installation setup. This will perform the same installation and configuration from CD without the need of the install server. Therefore you need to create a partial mirror of all Debian packages needed for your FAI classes (using `fai-mirror(1)`). Then the command `fai-cd(8)` will put this mirror, the nfsroot and the config space onto a bootable CD. That's it!
fr: Vous pouvez facilement créer un CD d’installation (ou une clé USB) de votre installation réseau. Cela permettra d’effectuer la même installation et la même configuration à partir du CD sans avoir besoin du serveur d’installation. Par conséquent, vous devez créer un miroir partiel de tous les paquets Debian nécessaires à vos classes FAI (à l’aide de `fai-mirror(1)`). Ensuite, la commande `fai-cd(8)` écrira ce miroir, le nfsroot et l’espace de configuration sur un CD amorçable. Et voilà !

source: To easily create the installation CD, you can use the following command (for more tuning details see `fai-cd(8)`):
fr: Pour créer facilement le CD d'installation, on peut utiliser la commande suivante (Pour plus de détails de configuration voir `fai-cd(8)`) :

source: This installation CD contains all data needed for the installation. The command `fai-cd(8)` puts the nfsroot, the configuration space and a subset of the Debian mirror onto a CD-ROM. A partial package mirror is created using the command `fai-mirror(1)` which contains all packages that are used by the classes used in your configuration space. A sample ISO image is available at https://fai-project.org/fai-cd.
fr: Ce CD d’installation contient toutes les données nécessaires à l’installation. La commande `fai-cd(8)` écrit le nfsroot, l’espace de configuration et un sous-ensemble du miroir Debian sur un CD-ROM. Un miroir de paquets partiel est créé à l’aide de la commande `fai-mirror(1)` qui contient tous les paquetages utilisés par les classes utilisées dans votre espace de configuration. Un échantillon d’image ISO est disponible à l’adresse https://fai-project.org/fai-cd.

source: Using the command `dd(1)` you can also create a bootable USB stick by just writing the content of the ISO file to your USB stick (here the stick is _/dev/sdf_).
fr: Avec la commande `dd(1)`, vous pouvez également créer une clé USB amorçable en écrivant simplement le contenu du fichier ISO sur votre clé USB (ici la clé est _/dev/sdf_).
