Repository: faiproject/fai
Catalog: doc/po/*.po
Languages: fr

source: * fai-setup has created the LOGUSER, the nfsroot and has added additional lines to _/etc/exports_. The subdirectories added to _/etc/exports_ are exported via NFS v3, so all install clients in the same subnet can mount them via NFS.
fr: * `fai-setup` a créé le LOGUSER, le nfsroot et a ajouté des lignes supplémentaires à _/etc/exports_. Les sous-répertoires ajoutés à _/etc/exports_ sont exportés via NFS v3, de sorte que tous les clients d’installation dans le même sous-réseau peuvent les monter via NFS.

source: === Creating the configuration space
fr: === Création de l’espace de configuration

source: Install the simple examples into the configuration space footnote:[These files need not belong to the root account.].
fr: Installez les exemples simples dans l’espace de configuration footnote:[Il n'est pas nécessaires que ces fichiers appartiennent au compte root.].

source: These examples contain configuration for some sample hosts. Depending on the host name used, your computer will be configured as follows:
fr: Ces exemples contiennent la configuration pour certains hôtes d’exemple. Selon le nom d’hôte utilisé, votre ordinateur sera configuré comme suit :

source: demohost:: A machine which needs only a small hard disk. This machine is configured with network as DHCP client, and an account demo is created.
fr: demohost:: Une machine qui n’a besoin que d’un petit disque dur. Cette machine est configurée avec le réseau en tant que client DHCP, et une démo de compte est créée.

source: xfcehost:: A XFCE desktop is installed, using LVM, and the account demo is created.
fr: xfcehost:: Un bureau XFCE est installé, utilisant LVM, et la démo du compte est créée.

source: gnomehost:: A GNOME desktop is installed, and the account demo is created.
fr: gnomehost:: Un bureau GNOME est installé et la démo du compte est créée.

source: ubuntuhost:: A Ubuntu desktop will be installed, and the account demo is created.
fr: ubuntuhost::\n" Un bureau Ubuntu sera installé et la démo du compte est créée.

source: other host names:: Hosts with another host name will most notably use the classes FAIBASE, DHCPC and GRUB.
fr: autres noms d'hôtes:: Les hôtes disposant d’un autre nom d’hôte utiliseront notamment les classes FAIBASE, DHCPC et GRUB.

source: All hosts will have an account called _demo_ with password _fai_. The root account also has the password _fai_.
fr: Tous les hôtes auront un compte appelé _demo_ avec mot de passe _fai_. Le compte root a également le mot de passe _fai_.

source: If the FAI flag +menu+ is added, instead of using the host name for determing the type of installation, a menu is presented, and the user can choose a profile for the installation.
fr: Si l’indicateur FAI +menu+ est ajouté, au lieu d’utiliser le nom d’hôte pour déterminer le type d’installation, un menu est présenté et l’utilisateur peut choisir un profil pour l’installation.

source: === Configure the network daemons
fr: === Configurer les démons réseau

source: For booting the install client via PXE, the install server needs a DHCP and a TFTP daemon running. The package _fai-quickstart_ has already installed the software packages for those daemons. Additionally the package of the NFS server for exporting the nfsroot and the config space was installed.
fr: Pour démarrer le client d’installation via PXE, le serveur d’installation a besoin d’un démon DHCP et d’un démon TFTP fonctionnels. Le paquet _fai-quickstart_ a déjà installé les paquets logiciels pour ces démons. En outre, le paquet du serveur NFS pour l’exportation du nfsroot et de l’espace de configuration a été installé.

source: ==== [[bootdhcp]]Configuration of the DHCP daemon
fr: ==== [[bootdhcp]]Configuration du démon DHCP

source: Ideally, your faiserver should also be your DHCP server. If that is not the case, instruct the admin responsible of the DHCP server to configure it according to this section. Optionally, it is possible to avoid that by using the <<autodiscover>> feature released in FAI 5.0.
fr: Idéalement, votre faiserver doit également être votre serveur DHCP. Si ce n’est pas le cas, demandez à l’administrateur responsable du serveur DHCP de le configurer conformément à cette section. Il est possible d'éviter cela optionnellement en utilisant la fonctionnalité <<autodiscover>> diffusée dans FAI 5.0.

source: An example for `dhcpd.conf(5)` is provided with the _fai-doc_ package. Start using this example and look at all options used therein.
fr: Un exemple pour `dhcpd.conf(5)` est fourni avec le paquet _fai-doc_. Commencez à utiliser cet exemple et regardez toutes les options qui y sont utilisées.

source: The only FAI specific information inside this configuration file is to set +filename+ (DHCP option 67) to +fai/pxelinux.0+ and to set +next-server+ (DHCP option 66, also called TFTP server name) and +server-name+ to the name of your install server. All other information is only network related data, which is used in almost all DHCP configurations. Adjust these network parameters to your local needs.
fr: Les seules informations spécifiques FAI contenues dans ce fichier de configuration sont d'assigner +filename+ (DHCP option 67) à la valeur +fai/pxelinux.0+ et d'assigner +next-server+ (DHCP option 66, also aussi nommée TFTP server name) et +server-name+ à la valeur du nom de votre serveur d’install . Toutes les autres informations sont uniquement des données liées au réseau, qui sont utilisées dans presque toutes les configurations DHCP. Ajustez ces paramètres de réseau à vos besoins locaux.

source: If you make any changes to the DHCP configuration, you must restart the daemon.
fr: Si vous apportez des modifications à la configuration DHCP, vous devez redémarrer le démon.

source: If you have multiple network interfaces, you can define on which interface the server will listen in _/etc/default/isc-dhcp-server_. By default, the DHCP daemon writes its log messages to '/var/log/daemon.log'.
fr: Si vous disposez de plusieurs interfaces réseau, vous pouvez définir l’interface que le serveur écoutera dans _/etc/default/isc-dhcp-server_. Par défaut, le démon DHCP écrit ses messages de journalisation dans _/var/log/daemon.log_.

source: ==== Adding a host entry to DHCP
fr: ==== Ajout d’une entrée d’hôte au DHCP

source: The MAC address is given by the hardware of the network card. For each install client you collect its MAC address and to map it to an IP address and to a host name. First, we add the IP address and the hostname to _/etc/hosts_ footnote:[You may also add this into your Domain Name System (DNS)]. ---- 192.168.33.100 demohost ----
fr: L’adresse MAC est donnée par le matériel de la carte réseau. Pour chaque client d’installation, vous collectez son adresse MAC et l'associez à une adresse IP et à un nom d’hôte. Tout d’abord, nous ajoutons l’adresse IP et le nom d’hôte à _/etc/hosts_ footnote:[On peut aussi ajouter cela dans son serveur de noms de domaine (DNS)]. ---- 192.168.33.100 demohost ----

source: The mapping from the MAC address to the IP address is done in the _dhcpd.conf_ file. Here, we add a host entry using the command `dhcp-edit(8)`. Here you have to replace 01:02:03:AB:CD:EF ith the MAC you have found. ---- # dhcp-edit demohost 01:02:03:AB:CD:EF ----
fr: L'association de l’adresse MAC à l’adresse IP est effectuée dans le fichier _dhcpd.conf_. Ici, nous ajoutons une entrée d’hôte en utilisant la commande `+dhcp-edit(8)+` . Ici, vous devez remplacer 01:02:03:AB:CD:EF avec l'adresse MAC que vous avez trouvé. ---- # dhcp-edit demohost 01:02:03:AB:CD:EF ----

source: After calling this command, this is what the host entry in _dhcpd.conf_ will look like: ---- host demohost {hardware ethernet 01:02:03:AB:CD:EF;fixed-address demohost;} ----
fr: Après l'invocation de cette commande, voici à quoi l'entrée d'hôte dans _dhcpd.conf_ ressemblera : ---- host demohost {hardware ethernet 01:02:03:AB:CD:EF;fixed-address demohost;} ----

source: Normally, you do not need any changes to the TFTP dameon configuration. The files which are provided by TFTP are located in _/srv/tftp/fai_.
fr: Normalement, vous n’avez pas besoin d’apporter de modifications à la configuration démon TFTP. Les fichiers fournis par TFTP sont situés dans _/srv/tftp/fai_.

source: The command `fai-setup` has already set up the NFS daemon and added some lines to the configuration file _/etc/exports_. It exports the directories using NFS v3.
fr: La commande `fai-setup` a déjà configuré le démon NFS et ajouté quelques lignes au fichier de configuration _/etc/exports_. Il exporte les répertoires en utilisant NFS v3.

source: === Creating the PXELINUX configuration
fr: === Création de la configuration PXELINUX

source: The last step before booting your client for the first time is to specify what configuration the client should boot when doing PXE boot. We use the command `fai-chboot(8)` to create a pxelinux configuration for each install client. This includes information about the kernel, the initrd, the config space and some boot parameters. You should read the manual page, which gives you some good examples. Here's the command for starting the installation for the host demohost.
fr: La dernière étape avant de démarrer votre client pour la première fois est de spécifier quelle configuration le client doit démarrer lors de l’amorçage PXE. Nous utilisons la commande `fai-chboot(8)` pour créer une configuration pxelinux pour chaque client d’installation. Cela comprend des informations sur le noyau, le fichier initrd, l’espace de configuration et certains paramètres d’amorçage. Vous devriez lire la page de manuel, qui vous donne quelques bons exemples. Voici la commande pour démarrer l’installation de l’hôte demohost.

source: At this point, you should have a working faiserver setup and your clients should boot into FAI and be able to install one of the examples.
fr: À ce stade, vous devriez avoir une configuration faiserver de travail et vos clients devraient démarrer dans FAI et être en mesure d’installer l’un des exemples.

source: In the following section, you can read about planning your installation, tailoring your configuration space to your particular needs and extending FAI using hooks.
fr: Dans la section suivante, vous pouvez lire la planification de votre installation, adapter votre espace de configuration à vos besoins particuliers et étendre FAI à l’aide de hooks.

source: === [[custom server]]Custom server
fr: === [[custom server]]Serveur personnalisé

source: The faiserver and its setup is by no means static. It is possible to customize and extend your server. For this, please refer to the <<Customizing your install server setup>> section in <<advanced>>.
fr: Le faiserver et sa configuration n’est nullement statique. Il est possible de personnaliser et d'étendre votre serveur. Pour cela, reportez-vous à la section<<Customizing your install server setup>> dans <<advanced>>."

source: == [[plan]]Plan your installation
fr: == [[plan]]Planifiez votre installation

source: Before starting your installation, you should invest a lot of time into planning your installation. Once you're happy with your installation concept, FAI can do all the boring and repetitive tasks to turn your plans into reality. FAI can't do good installations if your concept is imperfect or lacks some important details. Start planning the installation by answering the following questions:
fr: Avant de commencer votre installation, vous devriez investir beaucoup de temps dans la planification de votre installation. Une fois que vous êtes satisfait de votre concept d’installation, FAI peut faire toutes les tâches ennuyeuses et répétitives pour transformer vos plans en réalité. FAI ne peut pas faire de bonnes installations si votre concept est imparfait ou qu'il y manque quelques détails importants. Commencez à planifier l’installation en répondant aux questions suivantes :

source: * Will I create a Beowulf cluster, or do I have to install some desktop machines? * What does my LAN topology look like? * Do I have uniform hardware? Will the hardware stay uniform in the future? * Does the hardware need a special kernel? * How should the hosts be named? * How should the local hard disks be partitioned? * Which applications will be run by the users? * Do the users need a queuing system? * What software should be installed? * Which daemons should be started, and what should the configuration for these look like? * Which remote file systems should be mounted? * How should backups be performed?
fr: * Est-ce que je vais créer un cluster Beowulf ou dois-je installer des machines de bureau ? * À quoi ressemble ma topologie LAN ? * Ai-je un matériel uniforme ? Le matériel sera-t-il uniforme à l’avenir ? * Le matériel a-t-il besoin d’un noyau spécial ? * Comment nommer les hôtes ? * Comment les disques durs locaux doivent-ils être partitionnés ? * Quelles applications seront lancées par les utilisateurs ? * Les utilisateurs ont-ils besoin d’un système de mise en file d’attente ? * Quels logiciels faut-il installer ? * Quels démons devraient être lancés, et à quoi devrait ressembler leur configuration ? * Quels systèmes de fichiers distants doivent être montés ? * Comment effectuer les sauvegardes ?

source: You also have to think about user accounts, printers, a mail system, cron jobs, graphic cards, dual boot, NIS, NTP, timezone, keyboard layout, exporting and mounting directories via NFS and many other things. So, there's a lot to do before starting an installation. And remember that knowledge is power, and it's up to you to use it. Installation and administration is a process, not a product. FAI can't do things you don't tell it to do.
fr: Vous devez également penser à des comptes d’utilisateur, des imprimantes, un système de courrier, des travaux de cron, des cartes graphiques, au double amorçage, au NIS, au NTP, au fuseau horaire, à la disposition de clavier, à l’exportation et au montage des annuaires via NFS et à beaucoup d’autres choses. Donc, il ya beaucoup à faire avant de commencer une installation. Et rappelez-vous que la connaissance est le pouvoir, et c’est à vous de l’utiliser. L’installation et l’administration sont un processus et non un produit. FAI ne peut pas faire les choses que vous ne lui dites pas de faire.

source: You don't need to start from scratch. Look at the files and scripts in the configuration space. There are a lot of things you can use for your own installation. A good paper called "Bootstrapping an Infrastructure" with more aspects of building an infrastructure is available at http://www.infrastructures.org/papers/bootstrap/bootstrap.html
fr: Mais vous ne devez pas commencer à partir de zéro. Examinez les fichiers et les scripts dans l’espace de configuration. Il ya beaucoup de choses que vous pouvez utiliser pour votre propre installation. Un bon article intitulé « Bootstrapping an Infrastructure » avec d’autres aspects de la construction d’une infrastructure est disponible sur http://www.infrastructures.org/papers/bootstrap/bootstrap.html

source: === [[c3]]The configuration space and its subdirectories
fr: === [[c3]]L’espace de configuration et ses sous-répertoires

source: The configuration space is the collection of information about how exactly to install a client. The central configuration space for all install clients is located on the install server in '/srv/fai/config' and its subdirectories. This will be mounted by the install clients to '/var/lib/fai/config'. The main installation command `fai(8)` uses all these subdirectories in the order listed except for hooks.
fr: L'espace de configuration est la collection des informations qui disent comment exactement configurer un client. L'espace central de configuration pour tous les clients d'installation est situé sur le serveur d'installation dans '/srv/fai/config' et ses sous-répertoires. Il sera monté par les clients sous '/var/lib/fai/config'. La commande princpale d'installation `fai(8)` utilise tous ces sous-répertoires dans l'ordre listé sauf pour les hooks.

source: _class/_:: Scripts and files to define classes and variables.
fr: _class/_:: Scripts et fichiers pour définir des classes et des variables.

source: _disk_config/_:: Configuration files for disk partitioning, software RAID, LVM and file system creation.
fr: _disk_config/_:: Fichiers de configuration pour le partitionnement de disque, RAID logiciel, LVM et création de système de fichiers.

source: _basefiles/_:: Normally the file 'base.tar.xz' (located inside the nfsroot) is extracted on the install client after the new file systems are created and before package are installed. This is a minimal base image, created right after calling debootstrap during the creation of the nfsroot on the install server. If you want to install another distribution than the nfsroot is, you can put a tar file into the subdirectory 'basefiles/' and name it after a class. Then the command `ftar(8)` is used to extract the tar file based on the classes defined. Thus the file has to be named 'CLASS.tar.xz' not 'CLASS.base.tar.xz'. This is done in task _extrbase_. Use this if you want to install another distribution or version than that running during the installation. + This basefile can also be received based on FAI classes via HTTP/HTTPS or FTP by defining the variable +FAI_BASEFILEURL+. FAI will download a file CLASSNAME.tar.xz (or tgz, or tar.gz,...) from this URL, if +CLASSNAME+ matches a FAI class. + Example: ---- FAI_BASEFILEURL=https://fai-project.org/download/basefiles/ ---- The folder must support directory listing. FAI will not probe for potentially matching files.
fr: _basefiles/_:: Normalement , le fichier 'base.tar.xz' (situé à l'intérieur du nfsroot) est extrait sur le client d’installation après la création des nouveaux systèmes de fichiers et avant l’installation des paquets. Il s’agit d’une image de base minimale, créée juste après avoir appelé debootstrap lors de la création du nfsroot sur le serveur d’installation. Si vous voulez installer une autre distribution que celle du nfsroot, vous pouvez mettre un fichier tar dans le sous-répertoire 'basefiles/' et le nommer selon une classe. Ensuite, la commande `ftar(8)` est utilisée pour extraire le fichier tar en fonction des classes définies. Ainsi, le fichier doit être nommé 'CLASS.tar.xz' et non 'CLASS.base.tar.xz'. Cela se fait dans la tâche _extrbase_. Utilisez cette option si vous souhaitez installer une autre distribution ou une version différente de celle exécutée pendant l’installation. + Ce fichier de base peut également être reçu en fonction des classes FAI via HTTP/HTTPS ou FTP en définissant la variable +FAI_BASEFILEURL+. FAI téléchargera un fichier CLASSNAME.tar.xz (ou tgz, ou tar.gz, …) à partir de cette URL, si +CLASSNAME+ correspond à une classe FAI. + Exemple : ---- FAI_BASEFILEURL=https://fai-project.org/download/basefiles/ ---- Le dossier doit prendre en charge la liste des répertoires. FAI ne recherchera pas de fichiers potentiellement correspondants.

source: See chapter <<otherdists>> for how to install different distributions.
fr: Voir le chapitre <<otherdists>> pour savoir comment installer différentes distributions.

source: _debconf/_:: This directory holds all `debconf(7)` data. The format is the same that is used by `debconf-set-selections(1)`.
fr: _debconf/_:: Ce répertoire contient toutes les données `debconf(7)`. Le format est le même que celui utilisé par `debconf-set-selections(1)`.

source: _package_config/_:: Files with class names contain lists of software packages to be installed or removed by `install_packages(8)`. Files named '<CLASS>.gpg' are added to the list of keys used by apt for trusted package repositories.
fr: _package_config/_:: Les fichiers avec des noms de classe contiennent des listes de paquets à installer ou à désinstaller par `install_packages(8)`. Les fichiers nommés '<CLASS>.gpg' sont ajoutés à la liste des clés utilisées par apt pour les dépôts de paquets approuvés.

source: _pkgs/_:: This directory can contain subdirectories named by classes. You can put '.deb' or '.rpm' files into these subdirectories. FAI will then install these packages without the need of creating the metadata of a package repository.
fr: _pkgs/_:: Ce répertoire peut avoir des sous-répertoires nommés selon des classes. Vous pouvez mettre des fichiers '.deb' ou '.rpm' dans ces sous-répertoires. FAI installera ces paquets sans qu'il soit besoin de créer les métadonnées d'un dépôt de paquets.

source: _scripts/_:: Scripts for your local site customization. Used by `fai-do-scripts(1)`.
fr: _scripts/_:: Scripts pour la personnalisation de votre site local. Utilisé par `fai-do-scripts(1)`.

source: _files/_:: Files used by customization scripts. Most files are located in a subtree structure which reflects the ordinary directory tree. For example, the templates for 'nsswitch.conf' are located in '$FAI/files/etc/nsswitch.conf' and are named according to the classes that they should match: '$FAI/files/etc/nsswitch.conf/NIS' is the version of '/etc/nsswitch.conf' to use for the NIS class. Note that the contents of the files directory are not automatically copied to the target machine, rather they must be explicitly copied by customization scripts using the `fcopy(8)` command.
fr: _files/_:: Les Fichiers utilisés par les scripts de personnalisation. La plupart des fichiers se trouvent dans un sous-répertoire qui reflète l’arborescence de répertoires ordinaire. Par exemple, les modèles de `_nsswitch.conf_` se trouvent dans '$FAI/files/etc/nsswitch.conf' et sont nommés en fonction des classes auxquelles ils doivent correspondre : '$FAI/files/etc/nsswitch.conf/NIS' est la version de '/etc/nsswitch.conf' à utiliser pour la classe NIS. Notez que le contenu du répertoire n’est pas automatiquement copié sur la machine cible, mais qu’il doit être explicitement copié par des scripts de personnalisation à l’aide de la commande `fcopy(8)`.

source: _hooks/_:: Hooks are user defined programs or scripts, which are called during the installation process. They can extend or replace the default tasks. The file name must be of format 'taskname.CLASSNAME[.sh]'. A hook called +updatebase.DEBIAN+ is executed prior to the task `updatebase` and only if the install client belongs to the class DEBIAN.
fr: _hooks/_:: Les hooks sont des programmes ou des scripts définis par l’utilisateur, qui sont lancés pendant le processus d’installation. Ils peuvent étendre ou remplacer les tâches par défaut. Le nom du fichier doit être de format 'taskname.CLASSNAME[.sh]'. Un hook appelé +updatebase.DEBIAN+ est exécuté avant la tâche `updatebase` et seulement si l’installation du client fait partie de la classe DEBIAN.

source: === [[defining classes]]Defining classes
fr: === [[defining classes]]Définition des classes

source: There are different possibilities to define classes:
fr: Il existe différentes possibilités pour définir des classes :

source: . Some default classes are defined for every host: DEFAULT, LAST and its host name. . Classes may be listed within a file (by default in 'class/<hostname>') . Classes may be dynamically defined by scripts.
fr: . Certaines classes par défaut sont définies pour chaque hôte : DEFAULT, LAST et son nom d’hôte. . Les classes peuvent être répertoriées dans un fichier (par défaut dans 'class/<hostname>'). . Les classes peuvent être dynamiquement définies par des scripts.
