Repository: faiproject/fai
Catalog: doc/po/*.po
Languages: fr

source: - You can shorten some customization scripts by using one single fcopy command _fcopy -r /_.
fr: - Vous pouvez raccourcir certains scripts de personnalisation en utilisant une seule commande fcopy _fcopy -r /_.

source: - If you rebuild the nfsroot, you will create a new ssh host key inside the nfsroot. Then logging in to an install client may fail, because the host key changes. You can use this:
fr: - Si vous reconstruisez le nfsroot, vous allez créer une nouvelle clé hôte ssh dans le nfsroot. La connexion à un client d’installation peut échouer, car la clé hôte change. Vous pouvez utiliser ceci :

source: - You can also delete the host entry on your install client in your _~/.ssh/known_hosts_ file by using the _ssh-keygen -R_ command.
fr: - Vous pouvez également supprimer l’entrée hôte de votre client d’installation dans votre fichier _~/.ssh/known_hosts_ à l’aide de la commande _ssh-keygen -R_.

source: - In the tasks chboot and savelog, a connection using secure shell is opened to the FAI server (see <<isavelog>>). To ensure that this works non-interactively, a proper entry in 'NFSROOT/root/.ssh/known_hosts' must be created. When using fai-setup, this is done automatically, but it may require manual editing in case the name of your FAI server was not determined correctly. If you stumble over ssh connections that require typing "yes" to accept the host key during installation, please check the contents of your 'NFSROOT/root/.ssh/known_hosts file'
fr: - Dans les tâches chboot et savelog, une connexion utilisant un shell sécurisé est ouverte vers le serveur FAI (voir <<isavelog>>). Pour garantir que cela fonctionne de manière non interactive, une entrée appropriée dans 'NFSROOT/root/.ssh/known_hosts' doit être créée. Lors de l’utilisation de fai-setup, cela se fait automatiquement, mais il peut s’avérer nécessaire de l'éditer manuellement si le nom de votre serveur FAI n’a pas été correctement déterminé. Si vous trébuchez sur des connexions ssh qui nécessitent de taper "yes" pour accepter la clé hôte pendant l’installation, vérifiez le contenu de votre fichier 'NFSROOT/root/.ssh/known_hosts'
