Repository: faiproject/fai
Catalog: doc/po/*.po
Languages: fr

source: checks if one of classes A, B or C are defined. Using -a (logical AND) checks if all classes of a list are defined. The command 'ifclass C' checks if only class C is defined.
fr: Vérifie si l’une des classes A, B ou C est définie. L’utilisation de -a (ET, AND logique) vérifie si toutes les classes d’une liste sont définies. La commande 'ifclass C' vérifie si seule la classe C est définie.

source: For copying files with classes, use the command `fcopy(8)`. If you want to extract an archive using classes, use `ftar(8)`. For appending lines to a configuration file use `ainsl(1)` instead of just +echo string >> filename+.
fr: Pour copier des fichiers avec des classes, utilisez la commande `fcopy(8)`. Si vous voulez extraire une archive à l’aide de classes, utilisez `ftar(8)`. Pour ajouter des lignes à un fichier de configuration, utilisez `ainsl(1)` au lieu de simplement +echo string >> filename+.

source: FAI also supports 'zsh(1)' scripts during the customization task. Within scripts, the variable +$classes+ holds a space separated list with the names of all defined classes.
fr: FAI prend également en charge les scripts 'zsh(1)' pendant la tâche de personnalisation. Dans les scripts, la variable +$classes+ contient une liste séparée par des espaces avec les noms de toutes les classes définies.

source: ==== [[cfengine]]Cfengine scripts
fr: ==== [[cfengine]]Scripts cfengine

source: CFEngine has a rich set of functions to edit existing configuration files, e.g _LocateLineMatching, ReplaceAll, InsertLine, AppendIfNoSuchLine, HashCommentLinesContaining_. But it can't handle variables which are undefined. If a variable is undefined, the whole cfengine script will abort.
fr: CFEngine dispose d’un riche ensemble de fonctions pour modifier les fichiers de configuration existants, par exemple _LocateLineMatching, ReplaceAll, InsertLine, AppendIfNoSuchLine, HashCommentLinesContaining_. Mais il ne peut pas traiter les variables qui sont indéfinies. Si une variable n’est pas définie, l’ensemble du script cfengine s’arrêtera.

source: More information can be found in the manual page `cfengine(8)` or at the cfengine homepage https://www.cfengine.com.
fr: On peut trouver plus d’informations dans la page de manuel `cfengine(8)` ou sur la page d’accueil de cfengine https://www.cfengine.com.

source: === [[hooks]]Hooks
fr: === [[hooks]]Les hooks, les « crochets »

source: Hooks let you specify functions or programs which are run at certain steps of the installation process. Before a task is called, FAI searches for existing hooks for this task and executes them. As you might expect, classes are also used when calling hooks. Hooks are executed for every defined class. You only have to create the hook with the name for the desired class and it will be used. If several hooks for a task exists, they are called in the order defined by the classes. If _debug_ is included in +$FAI_FLAG+ the option _-d_ is passed to all hooks, so you can debug your own hooks. If some default tasks should be skipped, use the subroutine _skiptask_ and a list of default tasks as parameters. In the examples provided, the hooks of the class CENTOS skips some Debian specific tasks.
fr: Les crochets (hooks) vous permettent de spécifier des fonctions ou des programmes qui sont exécutés à certaines étapes du processus d’installation. Avant qu’une tâche soit appelée, FAI recherche les crochets existants pour cette tâche et les exécute. Comme on peut s’y attendre, les classes sont également utilisées lors de l’appel de hooks. Les hooks sont exécutés pour chaque classe définie. Il vous suffit de créer le hook avec le nom de la classe désirée et il sera utilisé. Si plusieurs hooks pour une tâche existent, ils sont appelés dans l’ordre défini par les classes. Si _debug_ est inclus dans +$FAI_FLAG+ l’option _-d_ est passée à tous les hooks, donc vous pouvez déboguer vos propres hooks. Si certaines tâches par défaut doivent être ignorées, utilisez la sous-routine _skiptask_ et une liste de tâches par défaut comme paramètres. Dans les exemples fournis, les hooks de la classe CENTOS ignorent certaines tâches spécifiques de Debian.

source: The directory '$FAI/hooks/' contains all hooks. A hook is an executable file following the naming scheme 'taskname.CLASSNAME[.sh]' (e.g. 'repository.CENTOS' or 'savelog.LAST.sh). The task name specifies which task to precede executing this hook, if the specified class is defined for the installing client. See section <<tasks>> for a complete list of default tasks that can be used.
fr: Le répertoire '$FAI/hooks/' contient tous les hooks. Un hook est un fichier exécutable qui est nommé selon la tâche : 'taskname.CLASSNAME[.sh]' (par exemple, 'repository.CENTOS' ou 'savelog.LAST.sh'). Le nom de tâche spécifie quelle tâche précède l'exécution de ce hook, si la classe spécifiée est définie pour le client d’installation. Voir la section <<tasks>> pour une liste complète des tâches par défaut qu'on peut utiliser.

source: A hook of the form _hookprefix.classname_ can't define variables for the installation script, because it's a subprocess. But you can use any binary executable or any script you wrote. Hooks that have the suffix _.sh_ (e.g. 'partition.DEFAULT.sh') must be Bourne shell scripts and are sourced. So it's possible to redefine variables for the installation scripts.
fr: Un hook du formulaire _hookprefix.classname_ ne peut pas définir de variables pour le script d’installation, car il s’agit d’un sous-processus. Mais vous pouvez utiliser n’importe quel exécutable binaire ou n’importe quel script que vous avez écrit. Les hooks qui ont le suffixe _.sh_ (par exemple, 'partition.DEFAULT.sh') doivent être des scripts Bourne shell et sont sourcé. Il est donc possible de redéfinir des variables pour les scripts d’installation.

source: In the first part of FAI, all hooks with prefix _confdir_ are called. Those hooks can not be located in the config space, since it's not yet available. Therefore these hooks are the only hooks located in +$nfsroot+'/$FAI/hooks' on the install server. All other hooks are found in '$FAI_CONFIGDIR/hooks' on the install server.
fr: Dans la première partie de FAI, tous les hooks avec le préfixe _confdir_ sont appelés. Ces hooks ne peuvent pas être localisés dans l’espace de configuration, car il n’est pas encore disponible. Par conséquent, ces hooks sont les seuls hooks situés dans +$nfsroot+'/$FAI/hooks' sur le serveur d’installation. Tous les autres hooks se trouvent dans '$FAI_CONFIGDIR/hooks' sur le serveur d’installation.

source: All hooks that are called before classes are defined can only use the following classes: _DEFAULT $HOSTNAME LAST_. If a hook for class _DEFAULT_ should only be called if no hook for class +$HOSTNAME+ is available, insert these lines to the default hook:
fr: Tous les hooks appelés avant la définition des classes peuvent utiliser uniquement les classes suivantes: _DEFAULT $HOSTNAME LAST_. Si un hook pour la classe _DEFAULT_ doit être appelé uniquement dans le cas où aucun hook pour la classe +$HOSTNAME+ n’est disponible, insérez ces lignes dans le hook par défaut :

source: # skip DEFAULT hook if a hook for $HOSTNAME exists scriptname=$(basename $0 .DEFAULT) [-f $FAI/hooks/$scriptname.$HOSTNAME ] && exit # here follows the actions for class DEFAULT . . ----
fr: # sauter le hook DEFAULT s'il existe un hook pour $HOSTNAME scriptname=$(basename $0 .DEFAULT) [-f $FAI/hooks/$scriptname.$HOSTNAME ] && exit # suivent alors les actions pour la classe DEFAULT . . ----

source: Some examples for what hooks could be used:
fr: Quelques exemples de ce à quoi les hooks pourraient être utiles :

source: - Load kernel modules before classes are defined in '$FAI/class'.
fr: - Charger les modules du noyau avant que les classes soient définies dans '$FAI/class'.

source: - Send an email to the administrator if the installation is finished.
fr: - Envoyer un courriel à l’administrateur si l’installation est terminée.

source: - Install a diskless client and skip local disk partitioning.
fr: - Installer un client sans disque et sautez le partitionnement de disque local.

source: - Have a look at +hooks/debconf.IMAGE+ for how to clone a machine using a file system image.
fr: - Jeter un œil à +hooks/debconf.IMAGE+ pour savoir comment cloner une machine en utilisant une image de système de fichiers.

source: === [[faiflags]]FAI flags
fr: === [[faiflags]]Options (flags) de FAI

source: The variable +$FAI_FLAGS+ contains a space separated list of flags. Flags are normally defined in the pxelinux.cfg file which should be created by 'fai-chboot(1)'. The following flags are known:
fr: La variable +$FAI_FLAGS+ contient une liste d'options séparées par des espaces. Les options sont normalement définies dans le fichier pxelinux.cfg qui est censément créé par 'fai-chboot(1)'. Les options suivantes sont connues :

source: verbose:: Create verbose output during installation. This should always be the first flag, so consecutive definitions of flags will be verbosely displayed.
fr: verbose:: Rend l'installation verbeuse. Cela doit toujours être la première option (le premier flag), de sorte que les définitions suivantes des options soient affichées verbeusement.

source: debug:: Create debug output. No unattended installation is performed. During package installation you have to answer all questions of the postinstall scripts on the client's console. A lot of debug information will be printed out. This flag is only useful for FAI developers.
fr: debug:: Afficher des informations de débogage. Aucune installation sans assistance n’est effectuée. Pendant l’installation du paquet, vous devez répondre à toutes les questions des scripts postinstall sur la console du client. Beaucoup d’informations de débogage seront affichées. Cette option n’est utile que pour les développeurs FAI.

source: sshd:: Start the ssh daemon to enable remote logins. You can then log in as _root_ to all install clients during the installation. The default password is _fai_ and can be changed by setting `FAI_ROOTPW` in `nfsroot.conf(5)`. To log in from your server to the install client (named demohost in this example) use:
fr: sshd:: Démarrer le démon ssh pour activer les connexions à distance. Vous pouvez ensuite vous connecter en tant que _root_ à tous les clients d’installation pendant l’installation. Le mot de passe par défaut est _fai_ et peut être modifié en définissant `FAI_ROOTPW` dans `nfsroot.conf(5)`. Pour vous connecter à partir de votre serveur vers le client d’installation (nommé demohost dans cet exemple), utilisez :

source: This is only the root password during the installation process, not for the new installed system. You can also log in without a password when using +$SSH_IDENTITY+.
fr: Ce n’est le mot de passe root que pendant le processus d’installation, pas pour le nouveau système installé. Vous pouvez également vous connecter sans mot de passe lorsque vous utilisez +$SSH_IDENTITY+.

source: createvt:: Create two virtual terminals and execute a bash if _ctrl-c_ is typed in the console terminal. The additional terminals can be accessed by typing _Alt-F2_ or _Alt-F3_. Otherwise, no terminals are available and typing _ctrl-c_ will reboot the install client. Setting this flag is useful for debugging. If you want an installation which should not be interruptible, do not set this flag.
fr: createvt:: Créez deux terminaux virtuels et exécutez un bash si _ctrl-c_ est tapé dans le terminal de console. Vous pouvez accéder aux terminaux supplémentaires en tapant _Alt-F2_ ou _Alt-F3_. Sinon, aucun terminal n’est disponible et la saisie _ctrl-c_ va redémarrer le client d’installation. La définition de cette option est utile pour le débogage. Si vous voulez une installation qui ne soit pas interruptible, ne définissez pas cette option.

source: menu:: This enables a user menu for selecting a profile. All files +class/*.profile+ are read and a curses based menu will be created.
fr: menu:: Cela active un menu utilisateur pour sélectionner un profil. Tous les fichiers +class/*.profile+ sont lus et un menu basé sur curses sera créé.

source: screen:: Run FAI inside a `screen(1)` session. The session is called FAI. If you log in via ssh from remote you can attach to the session using: ---- $ screen -x ----
fr: screen:: Lancer FAI dans une session `screen(1)`. La session est nommée FAI. Si on se connecte via ssh à distance on peut se rattacher à la session en utilisant : ---- $ screen -x ----

source: tmux:: Run FAI inside a `tmux(1)` session. The session is called FAI. If you log in via ssh from remote you can attach to the session using: ---- $ tmux attach ----
fr: tmux:: Lancer FAI dans une session `tmux(1)`. La session est nommée FAI. Si on se connecte via ssh à distance on peut se rattacher à la session en utilisant : ---- $ tmux attach ----

source: reboot:: Reboot the install client after installation is finished without typing RETURN on the console. If this flag is not set, and error.log contains anything, the install client will stop and wait that you press RETURN. If no errors occurred, the client will always reboot automatically.
fr: reboot:: Redémarrer le client d’installation une fois l’installation terminée sans taper Entrée sur la console. Si cette option n’est pas définie, et que error.log contient quelque chose, le client d’installation s’arrêtera et attendra que vous appuyez sur Entrée. Si aucune erreur ne s’est produite, le client redémarrera toujours automatiquement.

source: halt:: Halt the install client at the end of the installation, instead of rebooting into the new system.
fr: halt:: Arrêter le client d’installation à la fin de l’installation, au lieu de redémarrer dans le nouveau système.

source: initial:: Used by `setup-storage(8)`. Partitions marked with +preserve_reinstall+ are preserved unless this flag is set. Often, this flag is set in a file 'class/*.var' by using setting 'flag_initial=1'.
fr: initial:: Utilisé par `setup-storage(8)`. Les partitions marquées avec +preserve_reinstall+ sont préservées à moins que cette option ne soit définie. Souvent, cette option est définie dans un fichier 'class/*.var' en utilisant le paramètre 'flag_initial=1'.

source: == [[install]] FAI installs your plan
fr: == [[install]] FAI installe votre planification

source: === The early part of an installation
fr: === La première phase d’une installation

source: After the kernel has booted, it mounts the root file system via NFS from the install server and starts the script '/usr/sbin/fai' footnote:[Since the root file system on the clients is mounted via NFS, `fai` is located in '/srv/fai/nfsroot/usr/sbin' on the install server.]. This script controls the sequence of the installation. No other scripts in '/etc/init.d/' are used.
fr: Après le démarrage du noyau, on monte le système de fichiers racine via NFS à partir du serveur d’installation et on démarre le script '/usr/sbin/fai' footnote:[Comme le système de fichiers racine des clients est monté via NFS, `fai` se situe dans '/srv/fai/nfsroot/usr/sbin' sur le serveur d'installation.]. Ce script contrôle la séquence de l’installation. Aucun autre script dans '/etc/init.d/' n’est utilisé.

source: The configuration space is made available via the configured method (an NFS mount by default) from the install server to the path defined in '$FAI' footnote:['$FAI' is an internal variable used by the FAI scripts. By default the path is _/var/lib/fai/config_.]
fr: L’espace de configuration est rendu disponible via la méthode configurée (un montage NFS par défaut) depuis le serveur d’installation vers le chemin défini dans '$FAI' footnote:['$FAI' est une variable interne utilisée par les scripts FAI. Le chemin par défaut est _/var/lib/fai/config_.]

source: === [[bootmesg]]Boot messages
fr: === [[bootmesg]]Messages de démarrage

source: When booting the install client from network card with PXE you will see some messages like this: include::includes/bootexample.txt[]
fr: Lorsqu'on démarre le client d’installation à partir de la carte réseau avec PXE, on voit des messages comme ceci : include::includes/bootexample.txt[]

source: At this point the install client has successfully received the network config via DHCP and the kernel and initrd via TFTP. It now boots the Linux kernel and the initrd. If everything went right, the initrd mounts the nfsroot footnote:['/srv/fai/nfsroot' from the install server via NFS] and the FAI scripts are started. The first thing you see is the red FAI copyright message.
fr: À ce stade, le client d’installation a réussi à recevoir la configuration réseau via DHCP, le noyau et le fichier initrd via TFTP. Il démarre maintenant Le noyau Linux et met en place initrd. Si tout se passe bien, l’initrd monte le nfsroot footnote:['/srv/fai/nfsroot' depuis le serveur d'installation via NFS] et les scripts FAI sont lancés. La première chose qu'on voit est le message de copyright en rouge de FAI.

source: You can also see the list of FAI classes, that are defined for this host. This list is very important for the rest of the installation.
fr: On peut également voir la liste des classes FAI, qui sont définies pour cet hôte. Cette liste est très importante pour le reste de l’installation.

source: The first task is called _confdir_, which is responsible for getting access to the config space. Here, we use an NFS mount from the install server as you can see on the console (and later in the logs).
fr: La première tâche est appelée _confdir_, qui est chargée de accès à l’espace de configuration. Ici, on utilise un montage NFS depuis le serveur d'installation comme on peut le voir sur la console (et plus tard dans les journaux).

source: Before the installation is started (+$FAI_ACTION=install+) the computer beeps three times. So, be careful when you hear three beeps but you do not want to perform an installation and let FAI erase all yout data on the local disk!
fr: Avant de lancer l’installation (+$FAI_ACTION=install+), l’ordinateur émet trois bips. Donc, faites attention quand vous entendez trois bips et que vous ne voulez pas effectuer une installation, ni laisser FAI effacer toutes vos données sur Le disque local !

source: === [[reboot]]Rebooting the computer into the new system
fr: === [[reboot]]Redémarrage de l’ordinateur dans le nouveau système

source: For rebooting the computer during or at the end of the installation you should use the command `faireboot` in favour of the normal reboot command. Use `faireboot` also if logged in from remote. If the installation hasn't finished, use _faireboot -s_, so the log files are also copied to the install server.
fr: Pour redémarrer l’ordinateur pendant ou à la fin de l’installation, vous devez utiliser la commande `faireboot` de préférence à la commande de redémarrage normal. Utilisez aussi `faireboot` si vous êtes connecté à distance. Si l’installation n’est pas terminée, utilisez _faireboot -s_, afin que les fichiers journaux soient aussi copiés sur le serveur d’installation.

source: If the installation has finished successfully, the computer should boot a small Debian system. You can login as user _demo_ or _root_ with password _fai_.
fr: Si l’installation s'est bien terminée, l’ordinateur doit démarrer un petit système Debian. Vous pouvez vous connecter en tant qu'utilisateur _demo_ ou _root_ avec le mot de passe _fai_.

source: === [[isetup]]Starting FAI (task confdir)
fr: === [[isetup]]Démarrage de FAI (tâche confdir)

source: After the install client has booted only the script '/usr/sbin/fai' is executed. It will do some minimal initialization. The variable +$FAI_CONFIG_SRC+ footnote:[It is defined on the kernel command line] is used to get access to the FAI configuration space which is then available in the directory +$FAI+ footnote:[/var/lib/fai/config]. FAI will not proceed without the config space.
fr: Une fois le client d’installation démarré, seul le script '/usr/sbin/fai' est exécuté. Il effectuera une initialisation minimale. La variable +$FAI_CONFIG_SRC+ footnote:[Celle-ci est définie dans la ligne de commande du noyau] est utilisée pour accéder à l’espace de configuration FAI qui est alors disponible dans le répertoire +$FAI+ footnote:[/var/lib/fai/config]. FAI ne se fonctionnera pas sans l’espace de configuration.

source: You can access the config space using different methods. Supported methods are: nfs:, file:, cvs:, svn: git:, hg:, http: and detect:. See `fai.conf(5)` for a detailed description of these methods.
fr: On peut accéder à l'espace de configuration à l'aide de diverses méthodes. Les méthodes supportées sont : nfs:, file:, cvs:, svn: git:, hg:, http: et detect:. Voir `fai.conf(5)` pour une description détaillée de ces méthodes.

source: === [[iclass]]Defining classes and variables (tasks defclass and defvar)
fr: === [[iclass]]Définition de classes et de variables (tâches defclass et defvar)

source: The command `fai-class(1)` executes scripts in '$FAI/class' for defining classes. If the scripts write a string to stdout, this will be defined as a class. Read all the details in the man page of `fai-class(1)`.
fr: La commande `fai-class(1)` exécute des scripts dans '$FAI/class' pour définir des classes. Si les scripts écrivent une chaîne dans stdout, cela sera défini comme une classe. Lisez tous les détails dans la page de manuel de `fai-class(1)`.

source: After defining the classes, every file matching _.var_ with a prefix which matches a defined class is sourced to define variables. It must contain valid shell code.
fr: Après avoir défini les classes, chaque fichier correspondant à _.var_ avec un préfixe qui correspond à une classe définie est pris en compte pour définir des variables. Il doit contenir du code shell valide.

source: === [[ipartition]]Partitioning local disks, creating file systems (task partition)
fr: === [[ipartition]]Partitionnement des disques locaux, création des systèmes de fichiers (tâche partition)

source: For the disk partitioning exactly one disk configuration file from '$FAI/disk_config' is selected using classes.
fr: Pour le partitionnement du disque, un fichier de configuration de disque de '$FAI/disk_config' est sélectionné à l’aide de classes, et un seul.

source: The format of the disk configuration is similar to a fstab file.
fr: Le format de la configuration du disque est similaire à un fichier fstab.

source: The partitioning tool `setup-storage(8)` performs all commands necessary for creating the disk partition layout, software RAID, LVM and for creating the file systems. Disks and partitions may easily be referenced by disk1.1, disk2.4 etc. Read the manual page of `setup-storage(8)` for a detailed description and some examples of the format.
fr: L’outil de partitionnement `setup-storage(8)` exécute toutes les commandes nécessaires pour créer l'organisation des partitions du disque, du RAID logiciel, du LVM et pour créer les systèmes de fichiers. Lisez la page de manuel de `setup-storage(8)` pour une description détaillée et quelques exemples du format.

source: === [[ipreseed]]Debconf preseeding (task debconf) Files in '$FAI/debconf' are used for the usual `debconf(7)` preseeding if the file names match a class name.
fr: === [[ipreseed]]Pré-ensemencement Debconf (tâche debconf) Les fichiers dans '$FAI/debconf' sont utilisés par le système de pré-ensemencement habituel de `debconf(7)` si les noms de fichier correspondent à un nom de classe.

source: === [[ipackages]]Installing software packages (task instsoft)
fr: === [[ipackages]]Installation de paquets logiciels (tâche instsoft)
