Repository: faiproject/fai
Catalog: doc/po/*.po
Languages: fr

source: The last option is a very nice feature, since these scripts will define classes in a very flexible way. For example, several classes may be defined only if certain hardware is identified or a class is defined depending on the network subnet information.
fr: La dernière option est une fonctionnalité très intéressante, puisque ces scripts définiront des classes d'une façon très souple. Par exemple, plusieurs classes peuvent être définies uniquement si certains matériels sont identifiés ou si une classe est définie en fonction des informations du sous-réseau.

source: All names of classes, except the host name, are written in uppercase. They must not contain a hyphen, a hash, a semicolon or a dot, but may contain underscores and digits.
fr: Tous les noms de classes, sauf le nom d’hôte, sont écrits en majuscules. Ils ne doivent pas contenir de trait d’union, de dièse, de point-virgule ni de point, mais peuvent contenir des caractères de soulignement et des chiffres.

source: The task _defclass_ calls the command `fai-class(1)` to define classes. All scripts matching _^[0-9][0-9]*_ (they start with two digits) in the subdirectory _$FAI/class_ are executed for defining classes. Everything that is printed to STDOUT is automatically defined as a class. For more information on defining class, read the manual pages for `fai-class(1)`. The script _50-host-classes_ (see below a stripped version) is used to define classes depending on the host name.
fr: La tâche _defclass_ appelle la commande `fai-class(1)` pour définir les classes. Tous les scripts correspondant à l'expression _^[0-9][0-9]*_ (qui commencent avec deux chiffres) Dans le sous-repertoire _$FAI/class_ sont exécutés afin de définir les classes. Tout ce qui is affiché sur STDOUT est automatiquement defini comme une classe. Pour plus d’informations sur Les définitions de classe , lire les pages de manuel de `fai-class(1)`. Le script _50-host-classes_ (voir ci - dessous la version allégée) est utilisé pour les définir des classes en fonction du nom d’hôte.

source: Host names should rarely be used for the configuration files in the configuration space. Instead, a class should be defined and then added for a given host. This is because most of the time the configuration data is not specific for one host, but can be shared among several hosts.
fr: Les noms d’hôtes doivent rarement être utilisé pour les fichiers de configuration dans l’espace de configuration. Au lieu de ça, une classe doit être définie et ensuite ajoutée pour un hôte donné. En effet, la plupart du temps les données de configuration ne sont pas spécifiques à un nom d'hôte, mais peuvent être partagées entre différents hôtes.

source: The order of the classes is important because it defines the priority of the classes from low to high.
fr: L’ordre des classes est important car celui-ci définit la priorité des classes de faible à élevée.

source: === [[classvariables]]Defining variables
fr: === [[classvariables]]Définition des Variables

source: The task _defvar_ defines the variables for the install client. Variables are defined by scripts in _class/*.var_. All global variables can be set in 'DEFAULT.var'. For groups of hosts use a class file. For a single host use the file +$HOSTNAME+ _.var_. Also here, it's useful to study all the examples.
fr: La tâche _defvar_ definit les variables pour le client d'installation. Les variables sont définies par les scripts dans _class/*.var_. Toutes les variables globales peuvent être définies dans 'DEFAULT.var'. Pour un groupe d’hôtes utiliser un fichier de classe. Pour un hôte seul, utiliser le Fichier +$HOSTNAME+ _.var_. Ici aussi, il est utile d'étudier tous les exemples.

source: The following variables are used in the examples and may also be useful for your installation:
fr: Les variables suivantes sont utilisées dans les exemples et peuvent aussi être utiles pour votre installation :

source: FAI_ALLOW_UNSIGNED:: If set to 1, FAI allows the installation of packages from unsigned repositories.
fr: FAI_ALLOW_UNSIGNED:: Si cette variable vaut 1, FAI permet l’installation de paquets à partir de dépôts non signés.

source: CONSOLEFONT:: Is the font which is loaded during installation by `setfont(8)`.
fr: CONSOLEFONT:: La police de caractères qui est chargée lors de l’installation par `setfont(8)`.

source: KEYMAP:: Defines the keyboard map files in '/usr/share/keymaps' and '$FAI/files'. You don't need to specify the full path, since this file will be located automatically.
fr: KEYMAP:: Définit les fichiers de disposition du clavier dans '/usr/share/keymaps' et '$FAI/files'. Vous n'avez pas besoin de spécifier le chemin complet, car ce fichier sera localisé automatiquement.

source: ROOTPW:: The encrypted root password for the new system. You can use `crypt(3)`, md5 and other hash types for the password. Use `mkpasswd(1)` for creating the hash for a certain password. For example, to generate a md5 hash for the password use ---- $ echo "yoursecrectpassword" | mkpasswd -m yescrypt -s ----
fr: ROOTPW:: Le mot de passe root chiffré pour le nouveau système. Vous pouvez utiliser `crypt(3)`, md5 et d’autres types de hachage pour le mot de passe. Utilisez 'mkpasswd(1)+` pour créer le hachage d’un mot de passe donné. Par exemple, pour générer le hachage MD5 un mot de passe, utilisez : .... $ echo "votre_mot_secret" | mkpasswd -m yescrypt -s ....

source: UTC:: Set hardware clock to UTC if _UTC=yes_. Otherwise set clock to local time. See `clock(8)` for more information.
fr: UTC:: Règle l’horloge matérielle à UTC si _UTC=yes_. Sinon, règle l’horloge à l’heure locale. Voir `clock(8)` pour plus d’informations.

source: TIMEZONE:: Is the file relative to '/usr/share/zoneinfo/' which indicates your time zone. E.g.: _TIMEZONE=Europe/Berlin_.
fr: TIMEZONE:: C'est le fichier sous '/usr/share/zoneinfo/' qui indique votre fuseau horaire. Par exemple : _TIMEZONE=Europe/Berlin_.

source: MODULESLIST:: A list of kernel modules which are loaded during boot of the new system (written to /etc/modules).
fr: MODULESLIST:: Une liste des modules du noyau qui sont chargés pendant le démarrage du nouveau système (écrits dans /etc/modules).

source: === [[diskconfig]]Hard disk configuration
fr: === [[diskconfig]]Configuration du disque dur

source: The tool `setup-storage(8)` reads a file in '$FAI/disk_config' for the disk configuration. This file describes how all the local disks will be partitioned, which file system types should be created (like ext3/4, xfs, btrfs), and where they are mounted to. You can also create software RAID and LVM setups using this config file. It's also possible to preserve the disk layout or to preserve the data on certain partitions.
fr: L’outil `setup-storage(8)` lit un fichier dans '$FAI/disk_config' pour la configuration du disque. Ce fichier décrit comment tous les disques Locaux seront partitionnés, quels types de systèmes de fichiers doivent etre créés (comme ext3/4, xfs, btrfs), et où ils seront montés. Vous pouvez aussi créer des configurations RAID logiciel et LVM en utilisant ce fichier de configuration. Il est aussi possible de préserver le partitionnement du disque ou de préserver les données sur certaines partitions.

source: During the installation process all local file systems are mounted relative to '/target'. For example if you specify the mount point '/home' in a disk configuration file this will be the directory '/target/home' during the installation process and will become '/home' for the new installed system.
fr: Pendant le processus d’installation, tous les systèmes de fichiers locaux sont montés sous le répertoire '/target'. Par exemple, si vous spécifiez le point de montage '/home' dans un fichier de configuration de disque, ce sera le répertoire '/target/home' pendant le processus d’installation et ça deviendra '/home' pour le nouveau système installé.

source: === [[extrbase]]Extract base file
fr: === [[extrbase]]Extraction du fichier de base

source: A base file is only needed when installing a distribution which is different from the one in the nfsroot.
fr: Un fichier de base n'est nécessaire que si on installe une distribution qui est défférente de celle dans le nfsroot.

source: === [[debconf]]Debconf preseeding
fr: === [[debconf]]Pré-ensemencement Debconf

source: You can use the format described in `debconf-set-selections(1)`.
fr: On peut utiliser le fomat décrit dans `debconf-set-selections(1)`.

source: === [[repository]]Access to the package repository
fr: === [[repository]]Accès au dépôt de paquets

source: FAI supports http, https and NFS for accessing the package mirror. Set the variable '$FAI_DEBMIRROR' for using NFS.
fr: FAI supporte http, https, et NFS pour l'accès au miroir de paquets. Réglez la variable '$FAI_DEBMIRROR' pour l'utilisation de NFS.

source: === [[packageconfig]]Software package configuration
fr: === [[packageconfig]]Configuration des paquets logiciels

source: Before installing packages, FAI will add the content of all files named _package_config/class.gpg_ to the list of apt keys. If your local repository is signed by your keyid AB12CD34 you can easily add this key, so FAI will use it during installation. Use this command for creating the 'CLASS.gpg' file:
fr: Avant l’installation de paquets, FAI va ajouter le contenu de tous les fichiers nommés _package_config/class.gpg_ à la liste des clés apt. Si votre dépôt local est signé par votre keyid AB12CD34 vous pouvez facilement ajouter cette clé, ainsi FAI l’utilisera pendant l’installation. Utilisez cette commande pour créer le fichier 'CLASS.gpg' :

source: The script `install_packages(8)` installs the selected software packages. It reads all configuration files in '$FAI/package_config' whose file name matches a defined class. The syntax is very simple.
fr: Le script `install_packages(8)` installe les logiciels sélectionnés. Il lira tous les fichiers de configuration Dans '$FAI/package_config' dont le nom correspond à une classe définie. La syntaxe est très simple.

source: Comments are starting with a hash (#) and are ending at the end of the line. Every package command begins with the word _PACKAGES_ followed by a command name, which maps to a different package tool like apt-get, aptitude or dnf for e.g. The command defines which command will be used to install the packages named after this command. The list of all available commands can be listed using _install_packages -H_. Supported package tools are: _apt, apt-get, aptitude, smart, yast, dnf, rpm, zypper_
fr: Les commentaires commencent par une dièse (#) et se terminent à la fin de la ligne. Chaque commande de paquet commence par le mot _PACKAGES_ suivi par un nom de commande, qui correspond à gestionnaire de paquets distinct comme apt-get, aptitude ou dnf par exemple. la commande définit quelle commande sera utilisé pour installer les paquets nommés après cette commande. La liste de toutes les commandes disponibles peut être listée en utilisant _install_packages -H_. Les gestionnaires de paquets pris en charges sont _aptitude, apt-get, smart, yast, dnf, rpm, zypper_

source: hold:: Put a package on hold. This package will not be handled by dpkg, e.g not upgraded.
fr: hold:: Mettre un paquet en attente. Ce paquet ne sera pas pris en charge par dpkg, pas exemple il ne sera pas mis à niveau.

source: install:: Install all packages (using `apt-get`) that are specified in the following lines. If a hyphen is appended to the package name (with no intervening space), the package will be removed, not installed. All package names are checked for misspellings. Any package which does not exist, will be removed from the list of packages to install. So be careful not to misspell any package names.
fr: install:: Pour installer tous les paquets (en utilisant `apt-get`) qui sont précisés dans les lignes suivantes. Si un tiret est ajouté au nom du paquet (sans espace intermédiaire), le paquet sera supprimé, pas installé. Tous les noms de paquets sont vérifiées pour les fautes de frappe. Tout paquet qui n’existe pas, sera retiré de la liste des paquets à installer. Soyez donc attentif à ne pas mal orthographier les noms de paquets.

source: install-norec:: Like install but without installing the recommended packages.
fr: install-norec:: Comme install, mais sans installer les paquets recommandés.

source: remove:: Remove all packages that are specified in the following lines. Append a + to the package name if the package should be installed.
fr: remove:: Supprimer tous les paquets qui sont pécisés dans les lignes suivantes. Si on ajoute un + au nom du paquet, le paquet doit être installé.

source: taskinst:: Install all packages belonging to the tasks that are specified in the following lines using `tasksel(1)`. You can also use _aptitude_ for installing tasks.
fr: taskinst:: Installer tous les paquets appartenant aux tâches qui sont spécifiées dans les lignes suivantes à l’aide de `tasksel(1)`. Vous pouvez aussi utiliser _aptitude_ pour installer les tâches.

source: aptitude:: Install all packages with the command `aptitude`. This will be the default in the future and may replace apt-get and taskinst. Aptitude can also install task packages.
fr: aptitude:: Installer tous les paquets avec la commande `aptitude`. Ce sera la valeur par défaut à l’avenir et pourra remplacer apt-get et taskinst. Aptitude peut aussi installer les tâches de paquets.

source: aptitude-r:: Same as aptitude with option _--with-recommends_.
fr: aptitude-r:: Idem aptitude avec l’option _--with-recommends_.

source: unpack:: Download package and unpack only. Do not configure the package.
fr: unpack:: Télécharger les paquets et les décompresser seulement. Ne pas configurer les paquets.

source: dselect-upgrade:: Set package selections using the following lines and install or remove the packages specified. These lines are the output of the command _dpkg --get-selections_. It's not recommended to use this format, since you are also specifying all packages which are only installed because of a dependency or a recommends. It's better just to specify the pacakge you like to have, and to let FAI (and apt-get) resolve the dependencies.
fr: dselect-upgrade:: Definir des sélections des paquets en utilisant les lignes suivantes puis installer ou supprimer les paquets précisés. Ces lignes sont le résultat de la commande _dpkg --get-selections_. Il est recommandé de ne pas utiliser ce format, puisque cela spécifie aussi tous les paquets qui sont installés seulement en raison d’une dépendance ou d'une recommandation. Il vaut mieux juste spécifier le paquet que vous voulez avoir, et de laisser FAI (et apt-get) résoudre les dépendances.

source: Multiple lines with lists of space separated names of packages follow the PACKAGES lines. All dependencies are resolved. Packages with suffix _-_ (eg. _lilo-_) will be removed instead of installed. The order of the packages doesn't matter. If you like to install packages from another release than the default, you can append the release name to the package name like in _openoffice.org/etch-backports_. You can also specify a certain version like _apt=0.3.1_. More information on these features are described in `aptitude(8)`.
fr: Plusieurs lignes avec des listes de noms de paquets séparés par des espaces suivent les directive PACKAGES. Toutes les dépendances sont résolues. Les paquets avec suffixe _-_ (par exemple, _lilo-_) seront supprimés au lieu d'être installés. L’ordre des paquet n’a pas d’importance. Si vous souhaitez installer des paquets d’une autre version que la valeur par défaut, vous pouvez ajouter le nom de la version au nom du paquet comme dans _openoffice.org/etch-backports_. Vous pouvez également spécifier une certaine version comme _apt=0.3.1_. Plus d’informations sur ces fonctionnalités sont décrites dans `aptitude(8)`.

source: You can specify additional parameters for the package manager adding _key=value_ after _PACKAGES <command>_. Currently we support _release=<name>_ which will add _-t <name>_ when installing packages.
fr: On peut spécifier des paramètres supplémentaires pour le gestionnaire de paquets en ajoutant des paires _cle=valeur_ après _PACKAGES <commande>_. les paires clé, valeur actuellement supportées sont _release=<nom>_ qui ajoute _-t <nom>_ durant l'installation des paquets.

source: Example: ---- PACKAGES install-norec release=testing nvidia-smi ----
fr: Exemple: ---- PACKAGES install-norec release=testing nvidia-smi ----

source: This will install the nvidia-smi package from the testing release, including the dependencies. Don't forget to add an entry into 'sources.list'. You may also want to adjust the apt pinning (see 'apt_references(5)').
fr: Cela installerait le paquet nvidia-smi de la distribution testing, en incluant les dépendances. N'oubliez pas d'ajouter une entrée dans 'sources.list'. Vous pouvez aussi vouloir ajuste l'épinglage apt (apt pinning) (voir 'apt_references(5)')

source: A line which contains the _PRELOADRM_ commands, downloads a file using `wget(1)` into a directory before installing the packages. Using the _file:_ URL, this file is copied from +$FAI_ROOT+ to the download directory. For example the package `realplayer` needs an archive to install the software, so this archive is downloaded to the directory '/root'. After installing the packages this file will be removed. If the file shouldn't be removed, use the command _PRELOAD_ instead.
fr: Une ligne qui contient la commande _PRELOADRM_, télécharge un fichier à l’aide de `wget(1)` dans un répertoire avant d’installer les paquets. À l’aide d'une URL de type _file:_, ce fichier est copié de +$FAI_ROOT+ vers le répertoire de téléchargement. Par exemple, le paquet `realplayer` a besoin d’une archive pour installer le logiciel, donc cette archive est téléchargée dans le répertoire '/root'. Après l’installation des paquets, ce fichier sera supprimé. Si le fichier ne doit pas être supprimé, utilisez plutôt la commande _PRELOAD_.

source: You can add an arbitrary boolean expression using FAI classes to define when the list of packages should be installed. Here, the packages are only installed if the class XORG is defined but the class MINT is not defined.
fr: On peut ajouter une expression booléenne arbitraire qui utilise des classes FAI pour définir quand la liste des paquets devrait être installée. Ici, les paquets seront installés seulement si la classe XORG est définie mais la classe MINT n'est pas définie.

source: Example: ---- PACKAGES install UBUNTU && XORG && ! MINT ubuntu-standard ubuntu-desktop ----
fr: Exemple: ---- PACKAGES install UBUNTU && XORG && ! MINT ubuntu-standard ubuntu-desktop ----

source: The old way of adding some logic in the PACKAGES lines is still supported: It's possible to append a list of class names after the command for apt-get. So this _PACKAGES_ command will only be executed when at least one of the corresponding classes is defined (logical OR). So you can combine many small files into the file DEFAULT.
fr: L'ancienne façon d'ajouter des expressions logiques dans les lignes PACKAGES est encore valable : Il est possible d'ajouter une liste de noms de classes après la commande pour apt-get. Ainsi une telle commande _PACKAGES_ sera exécutée seulement au moins une des classes correspondantes est définie (OU logique). On peut donc combiner plusieurs petits fichiers dans le fichier DEFAULT.

source: If you want to remove a package name from a certain class was part of this class before, you should not remove the package name from the class file, but instead append a dash (-) to it. This will make sure that the package is removed during a softupdate on hosts which were installed using the old class definition which included this package name.
fr: Si vous souhaitez supprimer un nom de paquet d’une certaine classe faisait partie de cette classe précédemment, vous ne devez pas supprimer le nom du paquet classe, mais plutôt de lui ajouter un tiret (-). Cela garantira que le paquet soit enlevé pendant une mise a jour sur des hôtes qui étaient installés en utilisant l’ancienne définition de classe qui comprenait ce nom de paquet.

source: If you specify a package that does not exist this package will be removed automatically from the installation list only if the command _install_ is used.
fr: Si vous spécifiez un paquet qui n’existe pas, ce paquet sera supprimé automatiquement de la liste d’installation uniquement si la commande _install_ est utilisée.

source: The concept of classes priority allows a higher priority class (one that comes later in the sequence of classes) to override the selection of packages of a lower priority class. For this to work correctly, the higher priority class must use the same _PACKAGES_ command (e.g. _PACKAGES install-norec_ instead of just _PACKAGES install_) as the one used by the class it is trying to override. This is useful to suppress installation of a package, for example, to avoid installing the 'linuxlogo' package installed by class FAIBASE:
fr: Le concept de priorité des classes permet à une classe de priorité plus élevée (qui arrive plus tard dans la séquence des classes) d'écraser les sélections des paquets de priorité plus basse. Pour que cela fonctionne correctement, les classes de priorité plus élevée doivent utiliser les mêmes commandes _PACKAGES_ (par exemple _PACKAGES install-norec_ au lieu de seulement _PACKAGES install_) que celles qu'utilisent la classe qu'on essaie d'écraser. Cela est utile pour supprimer l'installation d'un paquet, par exemple, pour éviter d'installer le paquet 'linuxlogo' installé par la classe FAIBASE :

source: ---- # example of how to override: # # On FAIBASE we have: # PACKAGES install-norec # linuxlogo # # We want to _not_ install linuxlogo, and it is in a # install-norec section, so we must also use install-norec.
fr: ---- # exemple montrant comment écraser : # # Dans FAIBASE il y a : # PACKAGES install-norec # linuxlogo # # On veut _ne pas_ installer linuxlogo, et il se trouve dans # une section install-norec, donc il faut aussi utiliser install-norec.

source: === [[cscripts]] Customization scripts
fr: === [[cscripts]]Scripts de personnalisation

source: The command `fai-do-scripts(1)` is called to execute all scripts in this directory. If a directory with a class name exists, all scripts matching '^[0-9][0-9]*' are executed in alphabetical order. So it's possible to use scripts of different languages (shell, cfengine, Perl, Python, Ruby, expect,..) for one class.
fr: La commande `fai-do-scripts(1)` est lancée pour exécuter tous les scripts dans ce répertoire. Si un répertoire avec un nom de classe existe, tous les scripts correspondant à l'expression _^[0-9][0-9]*_ sont exécutés par ordre alphabétique. Il est donc possible d’utiliser des scripts de différentes langages (shell, cfengine, Perl, Python, Ruby, expect,..) pour une classe.

source: Thoses scripts write their output to sripts.log. The file status.log contains the names of all scripts executed and their exit status.
fr: Ces scripts écrivent leur sortie standard dans scripts.log. Le fichier status.log contient les noms de tous les scripts exécutés et leur statut de terminaison.

source: ==== [[shell]]Shell scripts
fr: ==== [[shell]]Scripts shell

source: Most scripts are Bourne shell scripts. Shell scripts are useful if the configuration task only needs to call some shell commands or create a file from scratch. In order not to write many short scripts, it's possible to use the `ifclass` command for testing if certain classes are defined.
fr: La plupart des scripts sont des scripts Bourne shell. Les scripts shell sont utiles si la tâche de configuration n'a besoin d'appeler que quelques commandes shell ou créer un fichier à partir de zéro. Afin d'éviter d'écrire beaucoup de scripts courts, il est possible d’utiliser la commande `ifclass` pour tester si certaines classes sont définies.
