Repository: faiproject/fai
Catalog: doc/po/*.po
Languages: fr

source: FAI Guide (Fully Automatic Installation) ======================================== Thomas Lange <lange@debian.org> Wed, 10 Apr 2025 :Date: a date :Revision: 6.4
fr: FAI Guide (Fully Automatic Installation) ======================================== Thomas Lange <lange@debian.org> Mer. 10 Avr 2025 :Date: une date :Revision: 6.4

source: //// <tt> => _ path <file => '' <var> => + <prgn> =>` ` (wie manref) <em> => _ ////
fr: //// <tt> => _ path <file => '' <var> => + <prgn> =>` ` (comme manref) <em> => _ ////

source: An older French version of this guide is available at https://fai-project.org/fai-guide-fr.
fr: Une version plus ancienne de ce guide en français est disponible à https://fai-project.org/fai-guide-fr.

source: Abstract -------- FAI is a non-interactive system to install, customize and manage Linux systems and software configurations on computers as well as virtual machines and chroot environments, from small networks to large infrastructures and clusters.
fr: Résumé ------ FAI est un système non-interactif pour installer, configurer et gérer des systèmes Linux et les configurations de logiciels sur des ordinateurs comme sur des machines virtuelles et des environnements chroot, depuis des petits réseaux jusqu'à de grandes infrastructures et de grands clusters.

source: This manual describes the Fully Automatic Installation software. This includes the installation of the packages, setting up the server, creating of the configuration and how to deal with errors.
fr: Ce manuel décrit le logiciel Fully Automatic Installation (installation entièrement automatique). Cela inclut l’installation des paquets, la configuration du serveur, la création de la configuration et la gestion des erreurs.

source: .Copyright This manual is free software; you may redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2, or (at your option) any later version.
fr: Ce manuel est un logiciel libre; Vous pouvez le redistribuer et / ou le modifier selon les termes de la Licence Publique Générale GNU publiée par la Free Software Foundation; Soit la version 2, soit (à votre choix) toute version ultérieure.

source: This is distributed in the hope that it will be useful, but *without any warranty*; without even the implied warranty of merchantability or fitness for a particular purpose. See the GNU General Public License for more details.
fr: Ceci est distribué dans l’espoir qu’il sera utile, mais sans aucune garantie ; Sans même la garantie implicite de qualité marchande ou d’adaptation à un usage particulier. Pour plus de détails, consultez la License Générale Publique GNU.

source: A copy of the GNU General Public License is available as '/usr/share/common-licenses/GPL' in the Debian GNU/Linux distribution or on the World Wide Web at https://www.gnu.org/copyleft/gpl.html[the GNU website] You can also obtain it by writing to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.
fr: Une copie de la Licence Générale Publique GNU est disponible sous la forme /usr/share/common-licenses/GPL dans la distribution Debian GNU/Linux ou sur le World Wide Web sur le site GNU Vous pouvez également l’obtenir en écrivant à la Free Software Foundation , Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, États-Unis.

source: === [[availability]]Availability
fr: === [[availability]]Disponibilité

source: Homepage:: https://fai-project.org
fr: Page d'accueil:: https://fai-project.org

source: FAI wiki:: https://wiki.fai-project.org
fr: Wiki FAI:: https://wiki.fai-project.org

source: Download:: https://fai-project.org/download
fr: Téléchargement:: https://fai-project.org/download

source: Entry for 'sources.list':: `deb https://fai-project.org/download bookworm koeln`
fr: Entrée pour 'sources.list':: `deb https://fai-project.org/download bookworm koeln`

source: Manual pages:: https://fai-project.org/doc/man/
fr: Pages de manuel:: https://fai-project.org/doc/man/

source: Mailing list:: https://lists.uni-koeln.de/mailman/listinfo/linux-fai
fr: Listes de diffusion:: https://lists.uni-koeln.de/mailman/listinfo/linux-fai

source: Feedback:: Send feedback and comments to mailto:fai@fai-project.org[] or to the mailing list.
fr: Retour d'information:: Envoyez vos réflexions et vos commentaires à mailto:fai@fai-project.org[] ou à la liste de diffusion.

source: Bugs:: Use the Debian bug tracking system (BTS) https://bugs.debian.org/src:fai
fr: Boguess:: Utiliser le système de suivi des bogues Debian (BTS) https://bugs.debian.org/src:fai

source: User visible changes:: https://fai-project.org/NEWS
fr: Changements visibles par l’utilisateur:: http://fai-project.org/NEWS

source: Source tree via git:: git clone git://github.com/faiproject/fai.git
fr: Arbre source via git:: git clone git://github.com/faiproject/fai.git

source: View source tree via https:: https://github.com/faiproject/fai
fr: Voir l’arbre source avec https:: https://github.com/faiproject/fai

source: The man pages always include up-to-date information and a lot of details of all FAI commands. So, don't forget to read them carefully. Now read this manual, then enjoy the fully automatic installation and your saved time.
fr: Les pages man incluent toujours des informations à jour et beaucoup de détails sur toutes les commandes FAI. Alors, n’oubliez pas de les lire attentivement. Lisez maintenant ce manuel, puis profitez de l’installation entièrement automatique et de votre temps économisé.

source: Have you ever performed identical installations of an operating system several times? Would you like to be able to install a Linux cluster with dozens of nodes single handedly?
fr: Avez-vous déjà effectué des installations identiques d’un système d’exploitation à plusieurs reprises? Souhaitez-vous être en mesure d’installer un cluster Linux avec des dizaines de nœuds d'un seul coup?

source: Repeating the same task again and again is boring -- and will surely lead to errors. Also a whole lot of time could be saved if the installations were done automatically. An installation process with manual interaction does not scale. But clusters have the habit of growing over the years. Think long-term rather than planning just a few months into the future.
fr: Répéter la même tâche encore et encore est ennuyeux -- et conduira certainement à des erreurs. Aussi beaucoup de temps pourrait être sauvé si les installations étaient faites automatiquement. Un processus d’installation avec interaction manuelle ne peut pas passer à l'échelle. Mais les grappes (clusters) ont l’habitude de croître au fil des ans. Pensez à long terme plutôt que de planifier seulement quelques mois dans l’avenir.

source: In 1999, I had to perform an installation of a Linux cluster with one server and 16 clients. Since I had much experience doing automatic installations of Solaris operating systems on SUN SPARC hardware, the idea to build an automatic installation for Debian was born. Solaris has an automatic installation feature called JumpStart footnote:[Solaris 8 Advanced Installation Guide at https://docs.oracle.com/cd/E19455-01/806-0957/806-0957.pdf ]. In conjunction with the auto-install scripts from Casper Dik footnote:[http://www.science.uva.nl/pub/solaris/auto-install], I could save a lot of time not only for every new SUN computer, but also for re-installation of existing workstations. For example, I had to build a temporary LAN with four SUN workstations for a conference, which lasted only a few days. I took these workstations out of our normal research network and set up a new installation for the conference. When it was over, I simply integrated the workstations back into the research network, rebooted just once, and after half an hour, everything was up and running as before. The configuration of all workstations was exactly the same as before the conference, because everything was performed by the same installation process. I also used the automatic installation for reinstalling a workstation after a damaged hard disk had been replaced. It took two weeks until I received the new hard disk but only a few minutes after the new disk was installed, the workstation was running as before. And this is why I choose to adapt this technique to a PC cluster running Linux.
fr: En 1999, j’ai dû effectuer une installation d’un cluster Linux avec un serveur et 16 clients. Puisque j’ai eu beaucoup d’expérience en faisant des installations automatiques des systèmes d’exploitation de Solaris sur le matériel de SUN SPARC, l’idée de construire une installation automatique pour Debian est née. Solaris dispose d’une fonctionnalité d’installation automatique appelée JumpStart footnote:[Solaris 8 Advanced Installation Guide at "https://docs.oracle.com/cd/E19455-01/806-0957/806-0957.pdf]. En conjonction avec les scripts d’auto-installation de Casper Dik footnote:[http://www.science.uva.nl/pub/solaris/auto-install], Je pouvais épargner beaucoup de temps non seulement pour chaque nouvel ordinateur de SUN, mais aussi pour la réinstallation des postes de travail existants. Par exemple, j’ai dû construire un LAN temporaire avec quatre stations de travail SUN pour une conférence, qui a duré seulement quelques jours. J’ai retiré ces postes de travail de notre réseau de recherche habituel et mis en place une nouvelle installation pour la conférence. Quand elle a été terminée, j’ai simplement réintégré les postes de travail dans le réseau de recherche, redémarré une seule fois, et après une demi-heure, tout était opérationnel comme avant. La configuration de tous les postes de travail était exactement la même qu’avant la conférence, car tout était effectué par le même processus d’installation. J’ai également utilisé l’installation automatique pour réinstaller un poste de travail après qu'un disque dur endommagé ait été remplacé. Il m’a fallu deux semaines pour recevoir le nouveau disque dur, mais seulement quelques minutes après l’installation du nouveau disque, le poste de travail fonctionnait comme avant. Et c’est pourquoi j’ai choisi d’adapter cette technique à un cluster de PC sous Linux.

source: === [[work]]How does FAI work
fr: === [[work]]Comment fonctionne FAI

source: The install client which will be installed using FAI, is booted via network card or from CD or USB stick. It gets an IP address and boots a Linux kernel which mounts its root file system via NFS (the nfsroot) from the install server. After the kernel is started, the FAI startup script performs the automatic installation which doesn't need any interaction. First, the hard disks will be partitioned, file systems are created and then software packages are installed. After that, the new installed operating system is configured to your local needs using some scripts. Finally, the new operating system will be booted from the local disk.
fr: Le client d’installation qui sera installé à l’aide de FAI, est démarré via une carte réseau ou à partir d’un CD ou d’une clé USB. Il obtient une adresse IP et démarre un noyau Linux qui monte son système de fichiers racine via NFS (nfsroot) du serveur d’installation. Une fois le noyau démarré, le script de démarrage FAI exécute l’installation automatique qui n’a pas besoin d’interaction. Tout d’abord, les disques durs seront partitionnés, les systèmes de fichiers seront créés et des paquets logiciels seront ensuite installés. Après cela, le nouveau système d’exploitation installé est configuré selon vos besoins locaux en utilisant quelques scripts. Enfin, le nouveau système d’exploitation sera démarré à partir du disque local.

source: The details of how to install the computer (the configuration) are stored in the configuration space on the install server. Configuration files are shared among groups of computers if they are similar using the class concept. So you need not create a configuration for every new host. Hence, FAI is a scalable method to install a big cluster with a great number of nodes even if their configuration is not identical.
fr: Les détails sur la façon d’installer l’ordinateur (la configuration) sont stockés dans l’espace de configuration sur le serveur d’installation. Les fichiers de configuration sont répartis entre des groupes d’ordinateurs s’ils sont similaires, en utilisant le concept de classe. Vous n’avez donc pas besoin de créer une configuration pour chaque nouvel hôte. Ainsi, FAI est une méthode évolutive pour installer un gros cluster avec un grand nombre de nœuds même si leur configuration n’est pas identique.

source: FAI can also be used as a rescue system or for hardware inventory. You can boot your computer, but it will not perform an installation. Instead it will run a fully functional Debian GNU/Linux without using the local hard disks. Then you can do a remote login and backup or restore a disk partition, check a file system, inspect the hardware or do any other task.
fr: FAI peut également être utilisé comme un système de sauvetage ou pour l’inventaire matériel. Vous pouvez démarrer votre ordinateur, mais il n’effectuera pas une installation. Au lieu de cela, il exécutera un Debian GNU / Linux entièrement fonctionnel sans utiliser les disques durs locaux. Ensuite, vous pouvez effectuer une connexion à distance et sauvegarder ou restaurer une partition de disque, vérifier un système de fichiers, inspecter le matériel ou effectuer toute autre tâche.

source: === [[features]]Features
fr: === [[features]]Caractéristiques

source: * A fully automated installation can be performed. * Very quick unattended installation. * Flexible system through easy class concept. * Update of running systems without re-installation. * Cloud images for virtualization environment. * Hosts can boot from network card, CD, USB stick. * Simple creation of an installation or live ISO. * PXE with DHCP boot method is supported. * ReiserFS, ext3/ext4, btrfs and XFS file system support. * Software RAID and LVM support. LUKS support. * Automatic hardware detection. * You can deploy Debian, Ubuntu, Rocky Linux, CentOS, AlmaLinux, SuSE * Remote login via ssh during installation process possible. * All similar configurations are shared among all install clients. * Log files for all installations are saved to the installation server. * Shell, Perl, Python, Ruby, expect and CFEngine scripts are supported during the customization step. * Support for many protocols like NFS, FTP, HTTPS, git. * Can be used as a rescue system and for hardware inventory. * Diskless client support. * Cross-architecture support e.g. for embedded devices. * Easily add your own functions via hooks or change the default behavior. * Cloning machines using disk images is supported.
fr: * On peut faire une installation entièrement automatisée. * Installation très rapide sans surveillance. * Système flexible grâce à un concept de classe simple. * Mise à jour des systèmes en cours d’exécution sans réinstallation. * Images « Cloud » pour un environnement de virtualisation. * Les hôtes peuvent démarrer à partir d’une carte réseau, d’un CD, d’une clé USB. * Création simple d’une image ISO vive ou pour l'installation. * Prise en charge de PXE avec la méthode de démarrage DHCP. * Support des systèmes de fichiers ReiserFS, ext3/ext4, btrfs et XFS. * Support logiciel RAID et LVM. Support LUKS. * Détection automatique du matériel. * On peut déployer Debian, Ubuntu, Rocky Linux, CentOS, AlmaLinux, SuSE * Possibilité de connexion à distance via ssh lors du processus d’installation. * Toutes les configurations similaires sont partagées entre tous les les clients d’installation. * Les fichiers journaux de toutes les installations sont enregistrés sur le serveur d’installation. * Prise en charge des scripts Shell, Perl, Python, Ruby, expect et CFEngine lors de l'étape de personnalisation. * Prise en charge de nombreux protocoles comme NFS, FTP, HTTP, git. * Peut être utilisé comme un système de sauvetage et pour l’inventaire matériel. * Prise en charge de clients sans disque. * Prise en charge trans-architecture, par exemple pour des appareils embarqués (embedded devices). * Ajoutez facilement vos propres fonctions via des hooks ou modifiez le comportement par défaut. * Prise en charge du clonage de machines utilisant des images de disque.

source: === Installation times
fr: === La durée d'installation

source: The installation time is determined by the amount of software and the speed of the hard disk. Here are some sample times. All install clients had a 1Gbit network card installed.
fr: La durée d’installation est déterminée par la quantité de logiciel et la vitesse du disque dur. Voici quelques exemples de durée. Tous les clients d’installation avaient une carte réseau 1Gbit installée.

source: [width="80%",cols="<4,^2,<3,>4,>2",options="header"] |================================================================= | CPU | RAM | Disk | Software installed | time | i7-3770T 2.50GHz | 8GB| SSD | 6 GB software | 8.5 min | Core-i7 3.2GHz | 6GB| SATA disk| 4.3GB software | 7 min | Core-i7 3.2GHz | 6GB| SATA disk| 471 MB software | 77sec | Intel Core2 Duo | 2GB| SATA disk| 3 GB software | 14 min |=================================================================
fr: [width="80%",cols="<4,^2,<3,>4,>2",options="header"] |================================================================= | CPU | RAM | Disque | Logiciels installés | durée | i7-3770T 2.50GHz | 8GB| SSD | 6 GB logiciel | 8.5 min | Core-i7 3.2GHz | 6GB| SATA disk| 4.3GB logiciel | 7 min | Core-i7 3.2GHz | 6GB| SATA disk| 471 MB logiciel | 77sec | Intel Core2 Duo | 2GB| SATA disk| 3 GB logiciel | 14 min |=================================================================

source: == [[impatient]]Quickstart - For the impatient user
fr: == [[impatient]]Quickstart - Pour l'utilisateur impatient

source: === [[first]]My first installation
fr: === [[first]]Ma première installation

source: Without further ado, this section will provide a quick and easy demonstration of a fully automatic installation using the FAI CD and a virtual machine.
fr: Sans plus tarder, cette section fournira une démonstration rapide et facile d’une installation entièrement automatique à l’aide du CD FAI et d’une machine virtuelle.

source: Just download the CD ISO image from https://fai-project.org/fai-cd and boot your VM using this CD. You will see a grub menu where you can select from different installation types.
fr: Il suffit de télécharger l' image ISO du CD à partir de https://fai-project.org/fai-cd et de démarrer votre VM à l’aide de ce CD. Vous verrez un menu grub où vous pouvez choisir parmi différents types d’installation.

source: This installation will run without an install server. The CD installation is the same as when run in a network environment using the FAI install server and can also be used from USB stick on a real computer.
fr: Cette installation s’exécutera sans serveur d’installation. L’installation à partir du CD est identique à celle exécutée dans un environnement réseau à l’aide du serveur d’installation FAI, et peut être aussi effectuée à l'aide d'une clé USB sur un ordinateur physique.

source: You can also create yourself a custom fully automated installation image on the webpage https://fai-project.org/FAIme without the need of installing FAI on your computer.
fr: On peut aussi créer soi-même une image FAI (installation entièrement automatique) à la page web https://fai-project.org/FAIme sans avoir besoin d'installer FAI sur son ordinateur.

source: === [[cdserver]]My first server installation
fr: === [[cdserver]]Ma première installation à l'aide d'un serveur

source: We will create a private network and start two virtual machines. One will become your own FAI server, the other will be an install client.
fr: Nous allons créer un réseau privé et lancer deux machines vituelles. L'une deviendra votre propre serveur FAI, l'autre sera un client d'installation.

source: If you intend to use VMware or VirtualBox, ensure that your client uses a bridged network connection. A detailed description is in the FAI wiki footnote:[https://wiki.fai-project.org/index.php/VirtualBox_for_your_first_FAI_installation]. Also, it is not possible to use bridged network interfaces over wireless, as most WiFi network cards do not support this feature.
fr: Si vous avez l’intention d’utiliser VMware ou VirtualBox, assurez-vous que votre client utilise une connexion réseau pontée (bridged network). On trouve une description détaillée dans le wiki FAI footnote:[https://wiki.fai-project.org/index.php/VirtualBox_for_your_first_FAI_installation]. on ne peut pas utiliser des interfaces réseau pontées via le réseau sans fil, car la plupart des cartes réseau WiFi ne prennent pas en charge cette fonctionnalité.

source: When using Qemu/KVM and the `fai-kvm` wrapper you can create the network using the command `fai-mk-network`. First install some packages
fr: Quand on utilise Qemu/KVM et le script `fai-kvm` on peut créer le réseau à l'aide de la commande `fai-mk-network`. Il faut commencer par installer quelques paquets logiciels

source: The next command sets up a private network with a software bridge with several tap devices that belong to the user +<username>+. ---- fai-mk-network <username> ----
fr: La commande ci-dessous met en place un réseau privé avec un pont logiciel et plusieurs TAPs réseau footnote:[https://fr.wikipedia.org/wiki/TAP_r%C3%A9seau] appartenant à l'utilisateur +<nom_d_utilisateur>+. ---- fai-mk-network <nom_d_utilisateur> ----

source: After that, you can use fai-kvm (-h will give you some help) for starting virtual machines using KVM that are connected to this private network. Be careful. By default, fai-kvm will create the disk images for the virtual machines in +/tmp+, which is a RAM disk on most systems. It's no problem to create an empty 20G disk image in /tmp (even if this partition is of 4GB size), but while the VM is writing data to its disk, this will start to consume space in +/tmp+.
fr: Après cela, vous pouvez utiliser fai-kvm (-h vous aidera) pour démarrer des machines virtuelles en utilisant KVM qui sont connectés à ce réseau privé. Faites attention. Par défaut, fai-kvm créera les images de disque pour les machines virtuelles dans `+/tmp+`, qui est un disque RAM sur la plupart des systèmes. Il n’y a aucun problème à créer une image de disque vide de 20G dans /tmp (même si cette partition est de 4 Go de taille), mais alors que la VM écrit des données sur son disque, cela commencera à consommer de l’espace dans `+/tmp+`.

source: Start the first virtual host, which will become the FAI server footnote:[This installation will consume about 2GB of space in +/tmp+.]: ---- fai-kvm -Vn -s20 -u 1 cd faicd64-small.iso ----
fr: Démarrez le premier hôte virtuel, qui deviendra le serveur FAI footnote:[Cette installation utilisera environ 2GB d'espace dans +/tmp+.] : ---- fai-kvm -Vn -s20 -u 1 cd faicd64-small.iso ----

source: In the grub menu select +faiserver, using internal DHCP and a fixed IP+. This will install a host called faiserver with IP 192.168.33.250 which contains all software needed for a FAI server. It will also set up a local package cache (using apt-cacher-ng). Once the installation is finished, reboot the machine. During the first boot of the new system, it will automatically set up the nfsroot. This may take some minutes.
fr: Dans le menu grub; sélectionnez +faiserver, using internal DHCP and a fixed IP+. Cela va installer un hôte appelé faiserver avec IP 192.168.33.250 qui contient tous les logiciels nécessaires pour un serveur FAI. Il configurera également un cache de paquets local (en utilisant apt-cacher-ng). Une fois l’installation terminée, redémarrez la machine. Lors du premier démarrage du nouveau système, il configurera automatiquement le nfsroot. Cela peut prendre quelques minutes.
