Repository: faiproject/fai
Catalog: doc/po/*.po
Languages: fr

source: `mk-data-partition` is a tool that extends an ISO (that will be copied to an USB stick) or an USB stick containing an ISO with an ext4 or exFAT partition and sets the file system label to MY-DATA. This partition is automatically mounted to '/media/data' by FAI. You can copy your own _.deb_ packages into this data partition und the subdiretories 'pkgs/<CLASSNAME>'. FAI will then install these packages if the equivalent class is defined.
fr: `mk-data-partition` est un outil qui étend une image ISO (qui sera copiée sur une clé USB) ou une clé USB contenant une image ISO avec une partition ext4 ou exFAT et y place le label MY-DATA. Cette partition est automatiquement montée dans '/media/data' par FAI. On peut copier ses propres paquets _.deb_ dans cette partition de données sous les sous-répertoires 'pkgs/<CLASSNAME>'. FAI installera alors ces paquets si la classe équivalente est définie.

source: Example how to use `mk-data-partition`:
fr: exemple d'usage de `mk-data-partition`:

source: ---- # mk-data-partition -s 1G -c faicd-large.iso A B ---- The former command creates the data partition of size 1 Gbytes inside the ISO file and copy directories A and B to it. You can then copy the modified ISO onto an USB stick.
fr: ---- # mk-data-partition -s 1G -c faicd-large.iso A B ---- La commande ci-desus crée la partition de données avec une taille de 1 Go dans le fichier ISO et y copie les répertoires A et B. On peut écrire l'image ISO modifiée sur une clé USB.

source: If the ISO is already on the USB stick and if it's available as _dev/sdf_, you can add a data partition of type exFAT will will use the whole remaining part of the USB stick by using this command: ---- # mk-data-partition -F /dev/sdf ----
fr: Si l'image ISO est déjà sur la clé USB, qui est disponible sous _dev/sdf_, on peut ajouter la partition de données de type exFAT qui utilisera tout l'espace disponible de la clé USB en utilisant cette commande : ---- # mk-data-partition -F /dev/sdf ----

source: === [[diskimage]]Creating VM disk images using FAI
fr: === [[diskimage]]Création d’images de disque VM à l’aide de FAI

source: The command `fai-diskimage(8)` creates disk images, which can be used with a virtual machine like KVM, VMware, VirtualBox or a cloud service like OpenStack, GCE, EC2 and others. The installation process performs the normal FAI tasks on a raw disk image. After the installation you can boot the disk image and have a running system. The disk image can also be converted to qcow2 format. You do not need to setup the FAI nfsroot when only using fai-diskimage. But you need a basefile in your configuration space. Setting the variable +$FAI_BASEFILEURL+ will automatically download an appropriate base file into your config space.
fr: En utilisant la commande `fai-diskimage(8)`, vous pouvez créer des images de disques qui peuvent être utilisées avec une machine virtuelle comme KVM, VMware, VirtualBox ou un service cloud comme OpenStack, GCE, EC2 et autres. Le processus d’installation exécute les tâches FAI normales sur une image de disque brut. Après l’installation, vous pouvez démarrer l’image disque et avoir un système fonctionnel. L’image disque peut également être convertie au format qcow2. Vous n'avez pas besoin de mettre en place le nfsroot de FAI quand vous utilisez seulement fai-diskimage. Mais vous avez besoin d'un fichier de base dans votre espace de configuration. Le réglage de la variable +$FAI_BASEFILEURL+ permet de télécharger automatiquement un fichier de base approprié dans votre espace de configuration.

source: Here's an example how to create a raw disk image for a host called cloud3, with a small set of software packages: ---- # export FAI_BASEFILEURL=https://fai-project.org/download/basefiles/ # fai-diskimage -vu cloud3 -S2G -cDEBIAN,BOOKWORM64,AMD64,FAIBASE,GRUB_PC,DHCPC,DEMO,CLOUD,LAST disk.raw ----
fr: Voici par exemple comment créer une image de disque brute pour un hôte nommé cloud3, avec un petit ensemble de paquets logiciels : ---- # export FAI_BASEFILEURL=https://fai-project.org/download/basefiles/ # fai-diskimage -vu cloud3 -S2G -cDEBIAN,BOOKWORM64,AMD64,FAIBASE,GRUB_PC,DHCPC,DEMO,CLOUD,LAST disk.raw ----

source: This command will create a disk image called ubuntu.qcow2 for a Ubuntu 16.04 desktop with hostname set to foobar. ---- # export FAI_BASEFILEURL=https://fai-project.org/download/basefiles/ # cl=DHCPC,UBUNTU,JAMMY,JAMMY64,AMD64,XORG,LAST # fai-diskimage -Nvu foobar -S5G -c$cl ubuntu.qcow2 ----
fr: Cette commande créera une image de disque nommée ubuntu.qcow2 pour une configuration de bureau Ubuntu 16.04 avec pour nom d'hôte machin. ---- # export FAI_BASEFILEURL=https://fai-project.org/download/basefiles/ # cl=DHCPC,UBUNTU,JAMMY,JAMMY64,AMD64,XORG,LAST # fai-diskimage -Nvu machin -S5G -c$cl ubuntu.qcow2 ----

source: You can give disk images a try without installing FAI, if you visit https://fai-project.org/FAIme/cloud
fr: Vous pouvez essayer quelques images de disques sans installer FAI, si vous visitez https://fai-project.org/FAIme/cloud

source: === [[live-image]]Creating a bootable live image
fr: === [[live-image]]Création d'une image vive amorçable

source: Creating a bootable live ISO is easy with FAI. You only need two steps. First, create your live environment using the command 'fai dirinstall'. Don't forget to add the class +LIVEISO+. Then create the live ISO using 'fai-cd':
fr: La création d'images ISO vives amorçables est facile avec FAI. Il suffit de deux étapes. Premièrement, créez votre environnement vif à l'aide de la commande 'fai dirinstall'. N'oubliez pas d'ajouter la classe +LIVEISO+. Ensuite, créez l'image ISO vive en utilisant 'fai-cd' :

source: The nfsroot is not needed for a live ISO. Currently there's no live ISO of the install server available.
fr: Le nfsroot n'est pas nécessaire pour une image ISO vive. Il n'y a pas actuellement d'image vive ISO disponible sur le serveur d'installation.

source: === [[cross-arch]]Building cross-architecture disk images
fr: === [[cross-arch]]Construire des images disque d'architecture différente (cross-architecture)

source: Starting FAI 5.4 it's now possible to build a disk image for different architectures than the host is running. For example you can build an image for 64-bit ARM architecture (aarch64) on a host running on amd64 architecture. Here are the steps do to:
fr: À partir de FAI 5.4 il devient possible de construire une image disque pour des architectures différentes de l'hôte qui est utilisé. Par exemple on peut construire une image pour une architecture ARM 64-bit (aarch64) sur un hôte qui fonctionne sur une architecture amd64. Voici les étapes successives :

source: Then you can run qemu as a normal user: ---- > qemu-system-aarch64 -m 1000 -M virt,gic_version=3 -cpu cortex-a57 -drive file=arm64.raw,if=virtio,index=1 -no-reboot -nographic -name ARM64 -net nic,name=eth0,model=virtio -net user,name=eth0,-kernel vmlinuz -initrd initrd -append "console=ttyAMA0 rw ip=dhcp root=/dev/vda1 net.ifnames=0" ----
fr: Ensuite on peut lancer qemu en tant qu'utilisateur ordinaire : ---- > qemu-system-aarch64 -m 1000 -M virt,gic_version=3 -cpu cortex-a57 -drive file=arm64.raw,if=virtio,index=1 -no-reboot -nographic -name ARM64 -net nic,name=eth0,model=virtio -net user,name=eth0,-kernel vmlinuz -initrd initrd -append "console=ttyAMA0 rw ip=dhcp root=/dev/vda1 net.ifnames=0" ----

source: This works similar for other architectures. Keep in mind, that qemu network setup will have poor performance if not using the virtio driver as above or tap devices.
fr: Ça fonctionne de même pour d'autres architectures. Il faut garder en tête que les réglages réseau de qemu ont des performances dégradées si on n'utilise pas le pilote virtio comme ci-dessus ou des TAPs réseaux.

source: You can find the base files for many architectures at https://fai-project.org/download/basefiles/, or use `mk-basefile` to create your own.
fr: On peut trouver les fichiers de base pour plusieurs architectures à https://fai-project.org/download/basefiles/, ou utiliser `mk-basefile` pour créer son fichier propre.

source: === [[sysinfo]]FAI rescue system
fr: === [[sysinfo]]Système de sauvetage FAI

source: If you set the variable +$FAI_ACTION+ to _sysinfo_ (for e.g. by using +fai-chboot -S+), the client will not install a new system, but will collect a lot of system information. If you set +$FAI_ACTION+ to _inventory_ you will only get a few hardware information. Both actions can be used for FAI as a rescue system.
fr: Si vous assignez à la variable +$FAI_ACTION+ la valeur _sysinfo_ (par exemple en utilisant fai-chboot -S), le client n’installera pas de nouveau système, mais collectera beaucoup d’informations système. Si vous assignez à +$FAI_ACTION+ la valeur _inventory_, vous ne recevrez que quelques informations sur le matériel. Les deux actions peuvent être utilisées pour FAI comme un système de sauvetage.

source: Type _ctrl-c_ to get a shell or use _Alt-F2_ or _Alt-F3_ and you will get another console terminal, if you have added _createvt_ to +$FAI_FLAGS+.
fr: Tapez _ctrl-c_ pour obtenir un shell ou utilisez _Alt-F2_ ou _Alt-F3_ et vous obtiendrez une autre console de terminal, si vous avez ajouté _createvt_ à +$FAI_FLAGS+.

source: You now have a running Linux system on the install client without using the local hard disk. Use this as a rescue system if your local disk is damaged or the computer can't boot properly from hard disk. You will get a shell and you can execute various commands (`dmesg`, `lsmod`, `df`, `lspci`, ...). Look at the log file in '/tmp/fai'. There you can find much information about the boot process.
fr: Vous voilà maintenant avec un système Linux qui fonctionne sur le client d’installation sans utiliser le disque dur local. Utilisez-le comme système de secours si votre disque local est endommagé ou si l’ordinateur ne peut pas démarrer correctement à partir du disque dur. Vous obtiendrez un shell et vous pouvez exécuter diverses commandes (`dmesg`, `lsmod`, `df`, `lspci`, …). Regardez le fichier journal dans `/tmp/fai`. Vous y trouverez de nombreuses informations sur le processus d’amorçage.

source: FAI mounts all file systems it finds on the local disks read only. It also tells you on which partition a file '/etc/fstab' exists. When only one file system table is found, the partitions are mounted according to this information. Here's an example:
fr: FAI monte tous les systèmes de fichiers qu’il trouve sur les disques locaux en lecture seule. Il vous indique également sur quelle partition un fichier '/etc/fstab' existe. Lorsqu’une seule table de système de fichiers est trouvée, les partitions sont montées selon ces informations. Voici un exemple :

source: *This method can be used as a rescue environment!* If you need a file system with read-write access use the `rwmount` command:
fr: *Cette méthode peut être utilisée comme un environnement de sauvetage !* Si vous avez besoin d’un système de fichiers avec accès en lecture/écriture, utilisez la commande `rwmount` :

source: === [[nonfs]]FAI without NFS
fr: === [[nonfs]]FAI sans NFS

source: To boot into FAI and begin the installation sequence without using the NFS protocol, you boot the client machine using PXE as usual and then retrieve an image containing the nfsroot via http.
fr: Pour démarrer dans FAI et commencer la séquence d’installation sans utiliser le protocole NFS, vous démarrez la machine cliente en utilisant PXE comme d’habitude, puis récupérez une image contenant le nfsroot via http.

source: To create an image, use fai-cd's -S argument and -M to avoid setting up a partial mirror within the image.
fr: Pour créer une image, utilisez l’argument -S de fai-cd et -M pour éviter de créer un miroir partiel à l'intérieur de l'image.

source: Move this image to a directory from which it can be requested via http (usually a directory served by the webserver)
fr: Déplacez cette image vers un répertoire à partir duquel elle peut être demandée via http (généralement un répertoire accessible par le serveur web)

source: To now request the squashfs image, add the following to your kernel command line, e.g. in your pxelinux configuration file for the client with fai-chboot.
fr: Pour demander alors l’image squashfs, ajoutez ce qui suit à votre ligne de commande du noyau, par exemple dans votre fichier de configuration pxelinux pour le client avec fai-chboot.

source: Replace faiserver with the domain name or IP of the machine your squash image is served from.
fr: Remplacez faiserver par le nom de domaine ou l'IP de la machine de laquelle votre image de squash est servie.

source: === [[otherdists]]Installing other distributions using a Debian nfsroot
fr: === [[otherdists]]Installation d’autres distributions à l’aide d’un nfsroot Debian

source: You can install all sorts of Linux distributions from a single Debian nfsroot. Therefore you have to create a base.tar.xz of the distribution you like to install and place it into the `basefiles` directory. Then name it UBUNTU2204.tar.xz for example. An install client which belongs to the class UBUNTU2204 then extracts this base file into its empty file system. Additionally you have to adjust the 'sources.list' or similar configuration files which are needed for specifying the location of the package repository.
fr: Vous pouvez installer toutes sortes de distributions Linux à partir d’un seul nfsroot Debian. Par conséquent, vous devez créer un fichier base.tar.xz de la distribution que vous souhaitez installer et le placer dans le répertoire `basefiles`. Puis nommez-le UBUNTU2204.tar.xz par exemple. Un client d’installation appartenant à la classe UBUNTU2204 extrait ensuite ce fichier de base dans son système de fichiers vide. De plus, vous devez ajuster les 'sources.list' ou les fichiers de configuration similaires nécessaires pour spécifier l’emplacement du dépôt de paquets.

source: The tool `rinse(8)` is used for creating base files for distribution like Rocky Linux, CentOS, openSUSE or Fedora. Some basefiles can be downloaded from https://fai-project.org/download/basefiles/.
fr: L’outils `rinse(8)` est utilisé pour créer des fichiers de base pour des distributions comme Rocky Linux, CentOS, openSUSE, ou Fedora. Certains fichiers de base peuvent être téléchargés à partir de https://fai-project.org/download/basefiles/.

source: The script +mk-basefile+ in '/usr/share/doc/fai-doc/examples/simple/basefiles/' helps creating this base files.
fr: Le script +mk-basefile+ dans '/usr/share/doc/fai-doc/examples/simple/basefiles/' aide à créer ces fichiers de base.

source: === [[dirinstall]]Creating chroot and virtualization environments
fr: === [[dirinstall]]Création d’environnements chroot et de virtualisation

source: If you have to create some chroot environments, or a virtualization environment where you neither can nor want to run a normal Debian Installer in to get to a working system (for example, Xen guest domains), there is the FAI action _dirinstall_. By calling
fr: Si vous devez créer certains environnements chroot, ou un environnement de virtualisation où vous ne pouvez ni ne voulez exécuter un programme d’installation Debian normal pour accéder à un système opérationnel (par exemple, les domaines hôtes Xen), il y a l’action FAI _dirinstall_. En appelant :

source: and using either the option _-c <classes>_ or _-N_ you get a FAI installation, without the partitioning action, right into the target directory. The host name for the target installation can be specified using _-u <host-name>_
fr: et en utilisant l’option _-c <classes>_ ou _-N_ vous obtenez une installation FAI, sans l’action de partitionnement, directement dans le répertoire cible. Le nom d’hôte de la cible d'installation peut être spécifié à l’aide de _-u <nom-d-hote>_

source: This, for example, can be used to combine FAI with the tool _xen-tools_, which helps you to build Xen guest domains. _xen-tools_ are very nice for generating configuration files and block devices for new guests based on simple commands and/or configuration files, but they can only assign one role per installation for customization. FAI-users need and want more, as they are used to have the class system. They get them even in xen-tools installations, by using the following code as a xen-tools role script:
fr: On peut utiliser cela, par exemple, pour combiner FAI avec les outils _xen-tools_, qui vous aident à construire des domaines invités Xen. Les _xen-tools_ sont très agréables pour générer des fichiers de configuration et bloquer des périphériques pour de nouveaux invités sur la base de commandes simples et/ou des fichiers de configuration, mais ils ne peuvent assigner qu’un seul rôle par installation pour la personnalisation. Les utilisateurs de FAI ont besoin de plus et en veulent, car ils ont l'habitude d'avoir le système de classes. Ils peuvent y arriver même dans les installations xen-tools, en utilisant le code suivant en tant que rôle xen-tools script :

source: Then, you should set the variable _install=0_ in the config of xen-tools for that host.
fr: Ensuite, il faut définir la variable _install=0_ dans la configuration xen-tools pour cet hôte.

source: === [[softupdate]]Using FAI for updates FAI can also do updates of already running systems, without a re-installation from scratch. This is called softupdate. A FAI softupdate skips the tasks which are not suitable for updating a running system, like partitioning the hard disks and creating file systems. Instead, it only executes the tasks for updating and installing software packages and calling the customization scripts.
fr: === [[softupdate]]Utilisation de FAI pour les mises à jour FAI peut également effectuer des mises à jour de systèmes déjà en cours d’exécution, sans réinstallation à partir de zéro. C’est ce qu’on appelle softupdate. Un FAI softupdate ignore les tâches qui ne sont pas adaptées à la mise à jour d’un système en cours d’exécution, comme le partitionnement des disques durs et la création de systèmes de fichiers. Au lieu de cela, il exécute uniquement les tâches de mise à jour et d’installation des paquets logiciels et l’appel des scripts de personnalisation.

source: To run a softupdate call: ---- # fai -v -s nfs://faiserver/srv/fai/config softupdate ----
fr: Pour lancer un softupdate : ---- # fai -v -s nfs://faiserver/srv/fai/config softupdate ----

source: By default, a softupdate uses the list of classes defined during the initial installation. Make sure to set the variable +$LOGSERVER+ (done in a _class/*.var_ file) if FAI should save the log files to a remote machine.
fr: Par défaut, un softupdate utilise la liste des classes définies lors de l’installation initiale. Assurez-vous de définir la variable +$LOGSERVER+ (ça se fait dans un fichier _class/*.var_) si FAI doit enregistrer les fichiers journaux sur une machine distante.

source: It's up to you, how to start a softupdate on a bigger number of hosts. You may do the softupdate on a regular basis via cron or you can use tools like `clusterssh(1)` to start a softupdate via a push on a list of hosts.
fr: C’est à vous de décider, comment démarrer un softupdate sur un plus grand nombre d’hôtes. Vous pouvez faire le softupdate sur régulièreent via cron ou vous pouvez utiliser des outils comme `clusterssh(1)` pour démarrer un softupdate via un push sur une liste d’hôtes.

source: Keep in mind, that the customization scripts are run every time you do a softupdate. That means, they have to be *idempotent* i.e. the result of their operation should always produce the same result, even when they run more than once.
fr: Gardez à l’esprit que les scripts de personnalisation sont exécutés chaque fois que vous faites un softupdate. Cela signifie qu’ils doivent être *idempotents*, c’est-à-dire que le résultat de leur fonctionnement doit toujours produire le même résultat, même lorsqu’ils fonctionnent plus d’une fois.

source: For example appending a line to a file must not done via this code:
fr: Par exemple, l’ajout d’une ligne à un fichier ne doit pas se faire via ce code :

source: ---- $ echo "some strings" >> /etc/fstab ---- Instead use the command `ainsl(1)` in a shell script or use cfengine's function _AppendIfNoSuchLine_.
fr: ---- $ echo "some strings" >> /etc/fstab ---- Au lieu de ça, utilisez la commande `ainsl(1)` dans un script shell ou utilisez la fonction de cfengine _AppendIfNoSuchLine_.

source: All commands in the customization script must be capable of modifying the target file system wether it's available in _/target_ during the initial installation or wether it's the normal file system relative to _/_ during softupdate.
fr: Toutes les commandes du script de personnalisation doivent être capables de modifier le système de fichiers cible qui’il soit disponible dans _/target_ lors de l’installation initiale ou qu'il soit le système de fichiers normal relatif à _/_ pendant le softtupdate.

source: Here are some variable that help writing these scripts:
fr: Voici quelques variables qui aident à écrire ces scripts :

source: +$target+:: Points to the root directory of the client, which is _/target_ during installation and _/_ during a softupdate.
fr: +$target+:: Pointe vers le répertoire racine du client, qui est _/target_ pendant l’installation et _/_ pendant un softupdate.

source: +$FAI_ROOT+:: It's the same value as +$target+. For historic reasons we have both these variables in FAI.
fr: +$FAI_ROOT+:: C’est la même valeur que +$target+. Pour des raisons historiques, on a ces deux variables dans FAI.

source: +$ROOTCMD+:: In case of the installation this is an alias for 'chroot $target' in case of softupdate it's just empty. You can prepend this to commands if you need to run a command inside the clients target file system via chroot.
fr: +$ROOTCMD+:: Dans le cas de l’installation, il s’agit d’un alias pour 'chroot $target' en cas de softupdate, c’est juste vide. Vous pouvez ajouter ceci avant les commandes si vous avez besoin d’exécuter une commande dans le système de fichiers cible des clients via chroot.

source: +$FAI_ACTION+:: If you need to call code depending on the FAI action performed, you can use this variable. It contains the currently executed action: _install_, _softupdate_, _dirinstall_, _sysinfo_, _inventory_ or your own defined action.
fr: +$FAI_ACTION+:: Si vous devez appeler le code en fonction de l’action FAI effectuée, vous pouvez utiliser cette variable. Elle contient l’action actuellement exécutée: _install_, _softupdate_, _dirinstall_, _sysinfo_, _inventory_ ou votre propre action définie.

source: === [[archcross]]How to install 32-bit OS from a 64-bit OS
fr: === [[archcross]]Comment installer un système d’exploitation 32 bits à partir d’un système d’exploitation 64 bits

source: To install a computer with a 32-bit OS, you need an i386 nfsroot. Creating this 32-bit nfsroot on an install server running amd64 is quite simple. Install and set up the FAI packages. Then copy your FAI config files to a new subdirectory.
fr: Pour installer un ordinateur avec un système d’exploitation 32 bits, vous avez besoin d’un nfsroot i386. La création de ce nfsroot 32 bits sur un serveur d’installation qui fonctionne sous amd64 est simple. Installez et configurez les paquets FAI. Copiez ensuite vos fichiers de configuration FAI dans un nouveau sous-répertoire.

source: Edit the variable +$FAI_DEBOOTSTRAP_OPTS+ in '/etc/fai-i386/nfsroot.conf' and add the option +--arch i386+. Also choose a different directory for your new nfsroot. Here are the two lines after editing.
fr: Modifiez la variable +$FAI_DEBOOTSTRAP_OPTS+ dans '/etc/fai-i386/nfsroot.conf' et ajoutez l’option +--arch i386+. Choisissez également un répertoire différent pour votre nouveau nfsroot. Voici les deux lignes après l'édition.
