Repository: faiproject/fai
Catalog: doc/po/*.po
Languages: fr

source: After that you can start additional hosts using network boot. For every new host, you have to use a different value for `-u`, which will be used for generating different MAC addresses and using different disk image file names.
fr: Après cela, vous pouvez démarrer des hôtes supplémentaires en utilisant un démarrage réseau. Pour chaque nouvel hôte, vous devez utiliser une valeur différente pour `+-u+`, qui sera utilisée pour générer des adresses MAC différentes et utiliser des noms de fichier d’image de disque différents.

source: Those install clients will show you a menu, where you can select which type of installation you like to perform. If the install client does not find the server, it is usually because fai-monitor is no longer running on it. This can happen, if you reboot the faiserver after the installation. To remedy this, simply run fai-monitor on the faiserver and re-attempt the client boot.
fr: Ces clients d’installation vous montreront un menu, où vous pouvez sélectionner le type d’installation que vous souhaitez effectuer. Si le client d’installation ne trouve pas le serveur, c’est généralement parce que fai-monitor n'y fonctionne plus. Cela peut se produire si vous redémarrez le faiserver après l’installation. Pour remédier à cela, exécutez simplement fai-monitor sur le faiserver et relancez le démarrage du client.

source: Another client could be started with: ---- fai-kvm -Vn -u 3 pxe ----
fr: Un autre client pourrait être lancé avec: ---- fai-kvm -Vn -u 3 pxe ----

source: You can start as many machines in the network as tap devices are available. All these machines can connect to the outside internet but are only reachable from your host machine.
fr: Vous pouvez démarrer autant de machines dans le réseau que de TAPs réseau disponibles. Toutes ces machines peuvent se connecter à l’Internet extérieur, mais sont seulement accessibles à partir de votre machine hôte.

source: == [[overview]]Overview and Concepts
fr: == [[overview]]Vue d'ensemble et Concepts

source: FAI is a non-interactive system to install, customize and manage Linux systems and software configurations on computers as well as virtual machines and chroot environments, from small networks to large infrastructures and clusters. You can take one or more virgin PCs, turn on the power and after a few minutes Linux is installed, configured and running on the whole cluster, without any interaction necessary. Thus, it's a scalable method for installing and updating a cluster unattended with little effort involved. FAI uses the Linux operating system and a collection of shell and Perl scripts for the installation process. Changes to the configuration files of the operating system can be made by CFEngine, shell (bash and zsh), Perl, Python, Ruby and expect scripts.
fr: FAI est un système non interactif permettant d’installer, de personnaliser et de gérer les configurations de systèmes et de logiciels Linux sur les ordinateurs ainsi que sur les machines virtuelles et les environnements chroot, des petits réseaux aux grandes infrastructures et clusters. Vous pouvez prendre un ou plusieurs PC vierges, mettre sous tension et après quelques minutes, Linux est installé, configuré et fonctionnel sur l’ensemble du cluster, sans aucune interaction nécessaire. Ainsi, il s’agit d’une méthode évolutive pour installer et mettre à jour un cluster sans surveillance impliquant peu d’efforts. FAI utilise le système d’exploitation Linux et une collection de scripts shell et Perl pour le processus d’installation. Les modifications apportées aux fichiers de configuration du système d’exploitation peuvent être effectuées par des scripts CFEngine, shell (bash et zsh), Perl, Python, Ruby et expect.

source: FAI's target group are system administrators who have to install Linux onto one or even hundreds of computers. Because it's a general purpose installation tool, it can be used for installing a Beowulf cluster, a rendering farm or a Linux laboratory or a classroom. Also large-scale Linux networks with different hardware or different installation requirements are easy to establish using FAI. But don't forget to plan your installation. Chapter <<plan>> has some useful hints for this topic.
fr: Les personnes intéressées par FAI sont des administrateurs système qui doivent installer Linux sur une ou même des centaines d’ordinateurs. Parce qu’il s’agit d’un outil d’installation à usage général, il peut être utilisé pour l’installation d’un cluster Beowulf, d’une ferme de rendu ou d’un laboratoire Linux ou d’une salle de classe. De plus, des réseaux Linux de grande envergure avec différents matériels ou différentes exigences d’installation sont faciles à établir à l’aide de FAI. Mais n’oubliez pas de planifier votre installation. Le chapitre <<plan>> contient quelques conseils utiles à ce sujet.

source: === [[terms]] Important Terms
fr: === [[terms]] Terminologie

source: First, some terms used in this manual are described.
fr: Commençons par décrire quelques termes utilisés dans ce manuel.

source: install server:: It provides DHCP, TFTP and NFS services and the configuration data for all install clients. In the examples of this manual this host is called 'faiserver'. The host where the package 'fai-server' is installed.
fr: Le serveur d'installation :: Il fournit les services DHCP, TFTP et NFS ainsi que les données de configuration pour tous les clients d’installation. Dans les exemples de ce manuel, cet hôte s’appelle 'faiserver'. C'est l’hôte où le paquet 'faiserver' est installé.

source: install client:: A host which will be installed using FAI and a configuration provided by the install server. Also called client for short. In this manual, the example hosts are called 'demohost, xfcehost, gnomehost ...' This computer should boot from its network interface using PXE.
fr: Le client d'installation :: Un hôte qui sera installé à l’aide de FAI et une configuration fournie par le serveur d’installation. Aussi appelé client pour faire court. Dans ce manuel, les hôtes d’exemple sont appelés demohost, xfcehost, gnomehost … Cet ordinateur doit démarrer à partir de son interface réseau à l’aide de PXE.

source: configuration space:: A subdirectory structure containg several files. Those files describe the details of how the installation of the clients will be performed. All configuration data is stored here. It's also called config space for short. It includes information about:
fr: Espace de configuration:: Une structure de sous-répertoire contenant plusieurs fichiers. Ces fichiers décrivent les détails de la manière dont l’installation des clients sera effectuée. Toutes les données de configuration sont stockées là. Il est également appelé _config space_ pour faire court. Il comprend des informations sur :

source: * Hard disk layout in a format similar to fstab * Local file systems, their types, mount points and mount options * Software packages * Keyboard layout, time zone, Xorg configuration, remote file systems, user accounts, printers ...
fr: * Organisation du disque dur dans un format similaire à fstab * Systèmes de fichiers locaux, leurs types, points de montage et options de montage * Paquets logiciels * Disposition du clavier, fuseau horaire, configuration Xorg, systèmes de fichiers distants, comptes utilisateurs, imprimantes …

source: + The package _fai-doc_ includes a sample configuration space including examples for hosts using the XFCE and GNOME environment amongst other examples. Calling `fai-mk-configspace` copies these examples to '/srv/fai/config'. It's recommended to study those config files and scripts for easier understanding how FAI works.
fr: + Le package _fai-doc_ inclut un exemple d’espace de configuration incluant des exemples pour les hôtes utilisant l’environnement XFCE et GNOME entre autres. En invoquant `fai-mk-configspace` on copie ces exemples vers '/srv/fai/config'. Il est recommandé d'étudier ces fichiers de configuration et ces scripts pour mieux comprendre comment FAI fonctionne.

source: nfsroot, NFS-Root:: A file system located on the install server. During the installation process it's the complete file system for the install clients. All clients share the same nfsroot, which they mount read only. The nfsroot needs about {nfsrootsize}GB of free disk space.
fr: nfsroot, NFS-Root :: Un système de fichiers situé sur le serveur d’installation. Pendant le processus d’installation, c’est le système de fichiers complet pour les clients d’installation. Tous les clients partagent le même nfsroot, qu’ils montent en lecture seule. Le nfsroot a besoin d’environ {nfsrootsize}Go d’espace disque libre.

source: TFTP:: Serves clients the initrd and kernel that is used for the installation process. Along with the file system served by NFS, these two make up a temporary OS in which the installations are performed.
fr: TFTP :: Sert aux clients le fichier initrd et le noyau utilisés pour le processus d’installation. Avec le système de fichiers servi par NFS, ces deux composent un système d'exploitation temporaire dans lequel les installations sont réalisées.

source: FAI classes:: Classes are names which determine which configuration file is selected. If a client belongs to class WEBSERVER, it will be configured as a webserver, the class DESKTOP for e.g. determines which software packages will be installed.
fr: Classes FAI :: Les classes sont des noms qui déterminent quel fichier de configuration est sélectionné. Si un client appartient à la classe WEBSERVER, il sera configuré en tant que serveur Web, la classe DESKTOP pour, par exemple, déterminer les paquets logiciels qui seront installés.

source: profile:: A FAI profile is just a list of FAI classes assiged to a profile name, which is extended by a description of this profile. I.e. one could have two "Webserver" profiles, one including the APACHE class another including the NGINX class, to then install the respective webserver solution.
fr: profil :: Un profil FAI est juste une liste de classes FAI assignées à un nom de profil, qui est étendu par une description de ce profil. C’est-à-dire que l’on peut avoir deux profils "Webserver", l’un incluant la classe APACHE, et un autre incluant la classe NGINX, pour ensuite installer la solution de serveur web correspondante.

source: tasks:: The installation of a client consists of several parts, which are called tasks. Tasks are predefined subroutines which perform a certain part of the FAI. The following FAI tasks are performed during an installation on the install clients.
fr: les tâches :: L’installation d’un client se compose de plusieurs parties, appelées tâches. Les tâches sont des sous-programmes prédéfinis qui effectuent une certaine partie de la FAI. Les tâches FAI suivantes sont exécutées au cours d’une installation sur les clients d’installation.

source: ____ confdir # get the config space setup # some initialization, start sshd on demand defclass # define FAI classes defvar # define variables action # evaluate FAI_ACTION install # Start the installation partition # partition the harddisks, create file systems mountdisks # mount the file systems extrbase # extract the base.tar.xz debconf # do the Debian debconf preseeding repository # prepare access to the package repository updatebase # Set up package tools and update packages instsoft # install software packages configure # call customization scripts finish # do some cleanup, show installation statistics tests # call tests if defined chboot # call fai-chboot on the install server savelog # save log files to local and remote location faiend # reboot host, eject CD if needed ____ ____
fr: ____ confdir # trouver l'espace de configuration setup # quelques initialisations, lancement de sshd à la demande defclass # définition des classes FAI defvar # définition de variables action # évaluer FAI_ACTION install # Démarrer l'installation partition # partitionner les disques durs, créer les systèmes de fichiers mountdisks # monter les systèmes de fichiers extrbase # extraire le fichier base.tar.xz debconf # pré-ensemencer le deconf de Debian repository # préparer l'accès aux dépôts de paquets updatebase # mettre en place les outils de gestion de paquets et mettre les paquets à jour instsoft # installer les paquets logiciels configure # lancer les scripts de personnalisation finish # faire un peu de ménage, afficher les statistiques d'installation tests # appeler des tests s'il y en a chboot # lancer fai-chboot sur le serveur d'installation savelog # enregistrer les fichiers de journalisation localement et à distance faiend # redémarrage de l'hôte, éjection du CD si nécessaire ____ ____

source: These are tasks, which are only executed when a different action is performed
fr: Voilà des tâches qui sont exécutées seulement lorsqu’on fait une action différente

source: dirinstall # install a chroot environment softupdate # only do the system configuration sysinfo # print detailed system information inventory # print short hardware inventory list ____
fr: dirinstall # installer un environnement chroot softupdate # ne faire que la configuration du système sysinfo # imprimer une information système détaillée inventory # imprimer un inventaire court du matériel ____

source: For a more in-depth description of _tasks_ , see <<tasks>>.
fr: Pour une description plus détaillée des _tâches_ , voir <<tasks>>.

source: Note that you are not limited to the FAI tasks. You can also define additional programs or scripts which will be run on particular occasions. They are called _hooks_.
fr: Notez que vous n'êtes pas limité aux tâches FAI. Vous pouvez également définir des programmes ou des scripts supplémentaires qui seront exécutés à certaines occasions. On les appelle des _hooks_.

source: hooks:: Hooks are plugins, they can add additional functionality to the installation process or even replace entire tasks of FAI. Hooks are explained in detail in <<hooks>>.
fr: hooks:: Les Hooks sont des plugins, ils peuvent ajouter des fonctionnalités supplémentaires au processus d’installation ou même remplacer des tâches entières de FAI. Les Hooks sont expliqués en détail dans <<hooks>>.

source: === [[classc]]The class concept
fr: === [[classc]]Le concept de classe

source: Classes are used in nearly all tasks of the installation. Classes determine which configuration files to choose from a list of available alternatives. To determine which config files to use, FAI searches the list of defined classes and uses all configuration files that match a class name footnote:[It's also possible to use only the configuration file with the highest priority since the order of classes define a priority from low to high within the list of classes. ]. The following loop implements this function in pseudo shell code:
fr: Les classes sont utilisées dans presque toutes les tâches de l’installation. Les classes déterminent quels fichiers de configuration choisir parmi une liste d’alternatives disponibles. Pour déterminer les fichiers de configuration à utiliser, FAI recherche dans la liste des classes définies et utilise tous les fichiers de configuration correspondant à un nom de classe footnote:[on peut aussi seulement utiliser le fichier de configuration qui a la priorité la plus élevée, comme l'ordre des classes définit une priorité de la plus basse à la plus élevée dans la liste des classes. ]. La boucle suivante implémente cette fonction en pseudo-code shell :

source: ---- for class in $all_classes; do if [ -r $config_dir/$class ]; then # if a file with name $class exists your_command $config_dir/$class # call a command with this file name # exit if only the first matching file is needed fi done ----
fr: ---- for class in $all_classes; do if [ -r $config_dir/$class ]; then # s'il exite un fichier nommé $class your_command $config_dir/$class # invoquer une commande avec ce nom de fichier # sortir si on n'a besoin que du premier fichier qui convient fi done ----

source: The very nice feature of this is that you can add a new configuration alternative and it will automatically be used by FAI without changing the code, if the configuration file uses a class name.
fr: La beauté de ceci c'est qu'on peut ajouter une nouvelle alternative de configuration et qu'elle sera automatiquement utilisée par FAI sans modifier le code, si le fichier de configuration utilise un nom de classe.

source: This is because the loop automatically detects new configuration files that should be used. The idea of using classes in general and using certain files matching a class name for a configuration is adopted from the installation scripts by Casper Dik for Solaris. This technique proved to be very useful and easy.
fr: C’est parce que la boucle détecte automatiquement les nouveaux fichiers de configuration qui doivent être utilisés. L’idée d’utiliser des classes en général et d’utiliser certains fichiers correspondant à un nom de classe pour une configuration est adoptée à partir des scripts d’installation par Casper Dik pour Solaris. Cette technique s’est avérée très utile et facile.

source: You can group multiple hosts that share the same configuration files by using the same class. You can also split the whole configuration data for all clients into several classes and use them like lego bricks and build the entire configuration for a single client by assembling the bricks together.
fr: Vous pouvez regrouper plusieurs hôtes partageant les mêmes fichiers de configuration en utilisant la même classe. Vous pouvez également diviser l’ensemble des données de configuration pour tous les clients en plusieurs classes et les utiliser comme des briques de lego et construire la configuration entière pour un seul client en assemblant les briques.

source: If a client belongs to class _A_, we say the class _A_ is defined for this client. A class has no value, it is just defined or undefined.
fr: Si un client appartient à la classe _A_, on dit que la classe _A_ est définie pour ce client. Une classe n’a pas de valeur, elle est juste définie ou indéfinie.

source: Classes determine how the installation is performed. For example, an install client can be configured to get the XFCE desktop by just adding the class _XFCE_ to it. Naturally, also more granular configurations are possible. For instance, classes can describe how the hard disk should be partitioned, they can define which software packages will be installed, or which customization steps are performed.
fr: Les classes déterminent comment l’installation est effectuée. Par exemple, un client d’installation peut être configuré pour obtenir le bureau XFCE en y ajoutant simplement la classe _XFCE_ . Naturellement, des configurations plus granulaires sont également possibles. Par exemple, les classes peuvent décrire comment le disque dur doit être partitionné, elles peuvent définir quels paquets logiciels seront installés, ou quelles étapes de personnalisation seront exécutées.

source: Often, a client configuration is created by only changing or appending the classes to which this client belongs, making the installation of a new client very easy. Thus no additional information needs to be added to the configuration space if the existing classes suffice for your needs.
fr: Souvent, une configuration client est juste créée en modifiant ou en ajoutant les classes auxquelles ce client appartient, ce qui rend l’installation d’un nouveau client très facile. Ainsi, aucune information supplémentaire ne doit être ajoutée à l’espace de configuration si les classes existantes suffisent à vos besoins.

source: As you can see, classes are a central pillar of customizing your configuration space and with that your client installation. On how to define your own classes, refer to <<defining classes>>.
fr: Comme vous pouvez le voir, les classes sont un pilier central de la personnalisation de votre espace de configuration et de celui de de votre client d'installation. Pour définir vos propres classes, reportez-vous à <<defining classes>>.

source: == [[setup]]Setup your faiserver
fr: == [[setup]]Configurer votre faiserver

source: Here's how to set up the install server in a few minutes. Following steps are needed:
fr: Voici comment configurer le serveur d’installation en quelques minutes. Les étapes suivantes sont nécessaires :

source: . Set up the install server .. Install FAI packages .. Create the nfsroot .. Copy the examples to the config space .. Configure network daemons .. Create the PXELINUX configurations . Boot and install clients
fr: . Configurer le serveur d’installation .. Installer les paquets de FAI .. Créer le nfsroot .. Copier les exemples dans l’espace de configuration .. Configurer les démons réseau .. Créer les configurations PXELINUX . Démarrage et installation des clients

source: === Install the FAI packages
fr: === Installer les paquets FAI

source: * Install the key of the FAI project package repository. * Add the URL of the package repository of the FAI project. * Install the package 'fai-quickstart' on your install server.
fr: * Installer la clé du dépôt de paquets du projet FAI. * Ajouter l’URL du dépôt de paquets du projet FAI. * Installer le paquet 'fai-quickstart' sur le serveur d'installation.

source: Use these commands for installing:
fr: Utilisez ces commandes pour l'installation :

source: and then ---- # apt-get update # aptitude install fai-quickstart ----
fr: et ensuite : ---- # apt-get update # aptitude install fai-quickstart ----

source: This will also install the packages for DHCP, TFTP and NFS server daemons.
fr: Cela installera également les paquets pour les démons de serveur DHCP, TFTP et NFS.

source: === Create the nfsroot
fr: === Créer le nfsroot

source: * Also enable the package repository of the FAI project in a different _sources.list_ file which is used when building the nfsroot. Then, enable the log user for FAI. ---- # sed -i -e 's/^#deb/deb/' /etc/fai/apt/sources.list # sed -i -e 's/#LOGUSER/LOGUSER/' /etc/fai/fai.conf ----
fr: * Activez également le dépôt de paquets du projet FAI dans un autre fichier _sources.list_ qui est utilisé lors de la construction du nfsroot. Ensuite, activez l’utilisateur de journal pour FAI. .... # sed -i -e 's/^#deb/deb/' /etc/fai/apt/sources.list # sed -i -e 's/#LOGUSER/LOGUSER/' /etc/fai/fai.conf ....

source: * By default, FAI uses http://deb.debian.org as package mirror, which should attempt to find a fast package repository for you. footnote:[If you want to use a faster mirror, adjust the URL in _/etc/fai/apt/sources.list_ and +FAI_DEBOOTSTRAP+ in _/etc/fai/nfsroot.conf_ before calling fai-setup.] Now, we can run `fai-setup(8)` footnote:[This will call `fai-make-nfsroot(8)` internally.] and check if everything went well. The log file is written to /var/log/fai/fai-setup.log.
fr: * Par défaut, FAI utilise http://httpredir.debian.org/ comme miroir de paquets, qui va tenter de trouver un dépôt de paquets rapide pour vous. footnote:[Si vous voulez un miroir plus rapide, ajustez l'URL dans _/etc/fai/apt/sources.list_ et +FAI_DEBOOTSTRAP+ dans _/etc/fai/nfsroot.conf_ avant de lancer fai-setup.] Ensuite, on peut lancer `fai-setup(8)` footnote:[Cela invoque `fai-make-nfsroot(8)` en interne.] Et vérifiez si tout s’est bien passé. Le fichier de journal est écrit dans /var/log/fai/fai-setup.log.

source: * These are some of the lines you will see at the end of _fai-setup_. A complete example of 'fai-setup.log' is available on the FAI web page at https://fai-project.org/logs/fai-setup.log.
fr: * Voilà quelques-unes des lignes que vous verrez à la fin de fai-setup. Un exemple complet de 'fai-setup.log' est disponible sur la page web FAI à https://fai-project.org/logs/fai-setup.log.
