Repository: faiproject/fai
Catalog: debian/po/*.po
Languages: de

source: Set install server hostname.
de: Setzen des hostnames des install servers.

source: Fai needs a name for the install server to be used.
de: Fai benötigt einen Namen des install servers.

source: In most cases this will be the hostname of the machine where the FAI package is installed, so we use this as a default value.
de: Im Allgemeinen wird das der hostname der Machine sein, wo das FAI Paket installiert wird, also ist das der Standardwert

source: In case you want your install clients to use another install server, please provide it's hostname.
de: Falls Sie einen anderen install server benützen möchten, geben Sie bitte dessen hostname an.

source: Fai needs the hostname of the debian mirror used for creating the nfsroot and to get packages for the actual installation.
de: Fai benötigt den hostname eines Debian-Paketspiegles für die Erzeugung des nfsroot und für die eigentliche Installation.

source: In case you are running your own debian mirror, and want to use this for FAI, please enter it's hostname here. In case you don't have an own debian mirror, you will most probably use ftp.debian.org for that, which we provide as a default.
de: Wenn Sie einen eigenen Debian-Paketspiegel betreiben, und diesen für FAI benützen möchten, geben Sie den hostname bitte hier ein. Ansonsten können Sie beispielsweise ftp.debian.org benützen.

source: Run fai-setup script now?
de: Soll fai-setup jetzt ausgeführt werden?

source: To be able to do installations with FAI, the script fai-setup needs to be run. In case you don't need to tweak the default fai config any further, this can be done for you now.
de: Um tatsächlich Installationen mit FAI durchzuführen, muss fai-setup ausgeführt werden. Wenn Sie die Standardeinstellungen nicht verändern möchten, kann das jetzt automatisch gestartet werden.

source: If you intend to have a look at and tweak the config files, it's perfectly O.K. if you run the script fai-setup manually after you consider the configuration O.K.
de: Wenn Sie noch einen Blick auf die Konfigurationsdateien werfen möchten, können Sie fai-setup auch später manuell ausführen.

source: Do you want the fai-setup script to be run now?
de: Soll fai-setup jetzt ausgeführt werden?
